#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;       Typed UAV Load Additional Formats
;
; shader debug name: 1c76a961ecc39d18f1bcebb3ebaa28e1.pdb
; shader hash: 1c76a961ecc39d18f1bcebb3ebaa28e1
;
; Buffer Definitions:
;
; cbuffer g_FrameBuffer
; {
;
;   struct hostlayout.g_FrameBuffer
;   {
;
;       struct hostlayout.struct.FrameBuffer
;       {
;
;           column_major float4x4 ProjectionToWorld;  ; Offset:    0
;           column_major float4x4 ModelViewInverse;   ; Offset:   64
;           float4 CameraPosition;                    ; Offset:  128
;       
;       } g_FrameBuffer;                              ; Offset:    0
;
;   
;   } g_FrameBuffer;                                  ; Offset:    0 Size:   144
;
; }
;
; cbuffer l_MeshBuffer
; {
;
;   struct l_MeshBuffer
;   {
;
;       struct struct.MeshBuffer
;       {
;
;           float4 Albedo;                            ; Offset:    0
;           int MeshID;                               ; Offset:   16
;           int MaterialID;                           ; Offset:   20
;           int VerticesOffset;                       ; Offset:   24
;           int IndicesOffset;                        ; Offset:   28
;       
;       } l_MeshBuffer;                               ; Offset:    0
;
;   
;   } l_MeshBuffer;                                   ; Offset:    0 Size:    32
;
; }
;
; Resource bind info for g_Indices
; {
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.7.2308.16 (52da17e29)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31, globals: !94)
!1 = !DIFile(filename: "Raytracing.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !5, !15, !22}
!4 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 37, baseType: !6)
!6 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 37, size: 96, align: 32, elements: !7, templateParams: !11)
!7 = !{!8, !9, !10}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !6, file: !1, line: 37, baseType: !4, size: 32, align: 32, flags: DIFlagPublic)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !6, file: !1, line: 37, baseType: !4, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !6, file: !1, line: 37, baseType: !4, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !4)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 43, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 43, size: 64, align: 32, elements: !17, templateParams: !20)
!17 = !{!18, !19}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, line: 43, baseType: !4, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, line: 43, baseType: !4, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !{!12, !21}
!21 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 50, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 50, size: 128, align: 32, elements: !24, templateParams: !29)
!24 = !{!25, !26, !27, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 50, baseType: !4, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 50, baseType: !4, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, line: 50, baseType: !4, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !23, file: !1, line: 50, baseType: !4, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!29 = !{!12, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 4)
!31 = !{!32, !38, !43, !46, !49, !52, !55, !59, !62, !71, !79, !80, !83, !86, !91}
!32 = !DISubprogram(name: "InitRandomSeed", linkageName: "\01?InitRandomSeed@@YAIII@Z", scope: !33, file: !33, line: 7, type: !34, isLocal: false, isDefinition: true, scopeLine: 8, flags: DIFlagPrototyped, isOptimized: false)
!33 = !DIFile(filename: "./Random.hlsl", directory: "")
!34 = !DISubroutineType(types: !35)
!35 = !{!36, !36, !36}
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !37)
!37 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!38 = !DISubprogram(name: "RandomInt", linkageName: "\01?RandomInt@@YAIAIAI@Z", scope: !33, file: !33, line: 22, type: !39, isLocal: false, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: false)
!39 = !DISubroutineType(types: !40)
!40 = !{!36, !41}
!41 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !36)
!43 = !DISubprogram(name: "RandomFloat", linkageName: "\01?RandomFloat@@YAMAIAI@Z", scope: !33, file: !33, line: 28, type: !44, isLocal: false, isDefinition: true, scopeLine: 29, flags: DIFlagPrototyped, isOptimized: false)
!44 = !DISubroutineType(types: !45)
!45 = !{!4, !41}
!46 = !DISubprogram(name: "SampleSquare", linkageName: "\01?SampleSquare@@YA?AV?$vector@M$02@@I@Z", scope: !33, file: !33, line: 39, type: !47, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: false)
!47 = !DISubroutineType(types: !48)
!48 = !{!5, !36}
!49 = !DISubprogram(name: "RandomInUnitDisk", linkageName: "\01?RandomInUnitDisk@@YA?AV?$vector@M$01@@AIAI@Z", scope: !33, file: !33, line: 45, type: !50, isLocal: false, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: false)
!50 = !DISubroutineType(types: !51)
!51 = !{!15, !41}
!52 = !DISubprogram(name: "RandomInUnitSphere", linkageName: "\01?RandomInUnitSphere@@YA?AV?$vector@M$02@@AIAI@Z", scope: !33, file: !33, line: 57, type: !53, isLocal: false, isDefinition: true, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: false)
!53 = !DISubroutineType(types: !54)
!54 = !{!5, !41}
!55 = !DISubprogram(name: "Schlick", linkageName: "\01?Schlick@@YAMMM@Z", scope: !1, file: !1, line: 31, type: !56, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: false)
!56 = !DISubroutineType(types: !57)
!57 = !{!4, !58, !58}
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!59 = !DISubprogram(name: "HitWorldPosition", linkageName: "\01?HitWorldPosition@@YA?AV?$vector@M$02@@XZ", scope: !1, file: !1, line: 39, type: !60, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: false)
!60 = !DISubroutineType(types: !61)
!61 = !{!5}
!62 = !DISubprogram(name: "HitAttribute", linkageName: "\01?HitAttribute@@YA?AV?$vector@M$02@@Y02V1@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 45, type: !63, isLocal: false, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: false)
!63 = !DISubroutineType(types: !64)
!64 = !{!5, !65, !68}
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 288, align: 32, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 3)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 42, size: 64, align: 32, elements: !69)
!69 = !{!70}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !68, file: !1, line: 42, baseType: !16, size: 64, align: 32)
!71 = !DISubprogram(name: "ScatterLambertian", linkageName: "\01?ScatterLambertian@@YA?AURayPayload@@V?$vector@M$03@@V?$vector@M$02@@1MI@Z", scope: !1, file: !1, line: 52, type: !72, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: false)
!72 = !DISubroutineType(types: !73)
!73 = !{!74, !22, !5, !5, !4, !36}
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayPayload", file: !1, line: 24, size: 288, align: 32, elements: !75)
!75 = !{!76, !77, !78}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "ColorAndDistance", scope: !74, file: !1, line: 26, baseType: !22, size: 128, align: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDirection", scope: !74, file: !1, line: 27, baseType: !22, size: 128, align: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "Seed", scope: !74, file: !1, line: 28, baseType: !36, size: 32, align: 32, offset: 256)
!79 = !DISubprogram(name: "ScatterMetal", linkageName: "\01?ScatterMetal@@YA?AURayPayload@@V?$vector@M$03@@V?$vector@M$02@@1MI@Z", scope: !1, file: !1, line: 65, type: !72, isLocal: false, isDefinition: true, scopeLine: 66, flags: DIFlagPrototyped, isOptimized: false)
!80 = !DISubprogram(name: "ScatterDielectric", linkageName: "\01?ScatterDielectric@@YA?AURayPayload@@V?$vector@M$03@@V?$vector@M$02@@1MIM@Z", scope: !1, file: !1, line: 80, type: !81, isLocal: false, isDefinition: true, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: false)
!81 = !DISubroutineType(types: !82)
!82 = !{!74, !22, !5, !5, !4, !36, !4}
!83 = !DISubprogram(name: "MyRaygenShader", linkageName: "\01?MyRaygenShader@@YAXXZ", scope: !1, file: !1, line: 102, type: !84, isLocal: false, isDefinition: true, scopeLine: 103, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?MyRaygenShader@@YAXXZ")
!84 = !DISubroutineType(types: !85)
!85 = !{null}
!86 = !DISubprogram(name: "MyClosestHitShader", linkageName: "\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 173, type: !87, isLocal: false, isDefinition: true, scopeLine: 174, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!87 = !DISubroutineType(types: !88)
!88 = !{null, !89, !90}
!89 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !74)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "MyAttributes", file: !1, line: 23, baseType: !68)
!91 = !DISubprogram(name: "MyMissShader", linkageName: "\01?MyMissShader@@YAXURayPayload@@@Z", scope: !1, file: !1, line: 219, type: !92, isLocal: false, isDefinition: true, scopeLine: 220, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z")
!92 = !DISubroutineType(types: !93)
!93 = !{null, !89}
!94 = !{!95, !97, !99, !134, !136, !140, !151, !155}
!95 = !DIGlobalVariable(name: "COLOR", scope: !80, file: !1, line: 90, type: !96, isLocal: true, isDefinition: true)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!97 = !DIGlobalVariable(name: "RAY_FLAG_FORCE_OPAQUE", scope: !0, file: !1, line: 144, type: !98, isLocal: true, isDefinition: true, variable: i32 1)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!99 = !DIGlobalVariable(name: "g_FrameBuffer", linkageName: "\01?g_FrameBuffer@@3U?$ConstantBuffer@UFrameBuffer@@@@A", scope: !0, file: !1, line: 10, type: !100, isLocal: false, isDefinition: true)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<FrameBuffer>", file: !1, line: 10, size: 32, align: 32, elements: !2, templateParams: !101)
!101 = !{!102}
!102 = !DITemplateTypeParameter(name: "T", type: !103)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "FrameBuffer", file: !104, line: 11, size: 1152, align: 32, elements: !105)
!104 = !DIFile(filename: "./RaytracingHLSLCompat.h", directory: "")
!105 = !{!106, !131, !132}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "ProjectionToWorld", scope: !103, file: !104, line: 13, baseType: !107, size: 512, align: 32)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMMATRIX", file: !108, line: 7, baseType: !109)
!108 = !DIFile(filename: "./HLSLCompat.h", directory: "")
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 10, baseType: !110)
!110 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 10, size: 512, align: 32, elements: !111, templateParams: !128)
!111 = !{!112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !110, file: !1, line: 10, baseType: !4, size: 32, align: 32, flags: DIFlagPublic)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !110, file: !1, line: 10, baseType: !4, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !110, file: !1, line: 10, baseType: !4, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !110, file: !1, line: 10, baseType: !4, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !110, file: !1, line: 10, baseType: !4, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !110, file: !1, line: 10, baseType: !4, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !110, file: !1, line: 10, baseType: !4, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !110, file: !1, line: 10, baseType: !4, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !110, file: !1, line: 10, baseType: !4, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !110, file: !1, line: 10, baseType: !4, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !110, file: !1, line: 10, baseType: !4, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !110, file: !1, line: 10, baseType: !4, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !110, file: !1, line: 10, baseType: !4, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !110, file: !1, line: 10, baseType: !4, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !110, file: !1, line: 10, baseType: !4, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !110, file: !1, line: 10, baseType: !4, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!128 = !{!12, !129, !130}
!129 = !DITemplateValueParameter(name: "row_count", type: !14, value: i32 4)
!130 = !DITemplateValueParameter(name: "col_count", type: !14, value: i32 4)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "ModelViewInverse", scope: !103, file: !104, line: 14, baseType: !107, size: 512, align: 32, offset: 512)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "CameraPosition", scope: !103, file: !104, line: 15, baseType: !133, size: 128, align: 32, offset: 1024)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMVECTOR", file: !108, line: 6, baseType: !22)
!134 = !DIGlobalVariable(name: "g_Scene", linkageName: "\01?g_Scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 12, type: !135, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?g_Scene@@3URaytracingAccelerationStructure@@A")
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 12, size: 32, align: 32, elements: !2)
!136 = !DIGlobalVariable(name: "g_Indices", linkageName: "\01?g_Indices@@3V?$StructuredBuffer@H@@A", scope: !0, file: !1, line: 13, type: !137, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<int>"* @"\01?g_Indices@@3V?$StructuredBuffer@H@@A")
!137 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<int>", file: !1, line: 13, size: 32, align: 32, elements: !2, templateParams: !138)
!138 = !{!139}
!139 = !DITemplateTypeParameter(name: "element", type: !14)
!140 = !DIGlobalVariable(name: "g_Vertices", linkageName: "\01?g_Vertices@@3V?$StructuredBuffer@UVertex@@@@A", scope: !0, file: !1, line: 14, type: !141, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<Vertex>"* @"\01?g_Vertices@@3V?$StructuredBuffer@UVertex@@@@A")
!141 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<Vertex>", file: !1, line: 14, size: 256, align: 32, elements: !2, templateParams: !142)
!142 = !{!143}
!143 = !DITemplateTypeParameter(name: "element", type: !144)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vertex", file: !104, line: 27, size: 256, align: 32, elements: !145)
!145 = !{!146, !148, !149, !150}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !144, file: !104, line: 29, baseType: !147, size: 96, align: 32)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !108, line: 4, baseType: !5)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !144, file: !104, line: 30, baseType: !4, size: 32, align: 32, offset: 96)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "Normal", scope: !144, file: !104, line: 31, baseType: !147, size: 96, align: 32, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !144, file: !104, line: 32, baseType: !4, size: 32, align: 32, offset: 224)
!151 = !DIGlobalVariable(name: "g_RenderTarget", linkageName: "\01?g_RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 16, type: !152, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?g_RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!152 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 16, size: 128, align: 32, elements: !2, templateParams: !153)
!153 = !{!154}
!154 = !DITemplateTypeParameter(name: "element", type: !23)
!155 = !DIGlobalVariable(name: "l_MeshBuffer", linkageName: "\01?l_MeshBuffer@@3U?$ConstantBuffer@UMeshBuffer@@@@A", scope: !0, file: !1, line: 21, type: !156, isLocal: false, isDefinition: true)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<MeshBuffer>", file: !1, line: 21, size: 32, align: 32, elements: !2, templateParams: !157)
!157 = !{!158}
!158 = !DITemplateTypeParameter(name: "T", type: !159)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshBuffer", file: !104, line: 18, size: 256, align: 32, elements: !160)
!160 = !{!161, !163, !164, !165, !166}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "Albedo", scope: !159, file: !104, line: 20, baseType: !162, size: 128, align: 32)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT4", file: !108, line: 5, baseType: !22)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "MeshID", scope: !159, file: !104, line: 21, baseType: !14, size: 32, align: 32, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "MaterialID", scope: !159, file: !104, line: 22, baseType: !14, size: 32, align: 32, offset: 160)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "VerticesOffset", scope: !159, file: !104, line: 23, baseType: !14, size: 32, align: 32, offset: 192)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "IndicesOffset", scope: !159, file: !104, line: 24, baseType: !14, size: 32, align: 32, offset: 224)
!167 = !{i32 2, !"Dwarf Version", i32 4}
!168 = !{i32 2, !"Debug Info Version", i32 3}
!169 = !{!"dxcoob 1.7.2308.16 (52da17e29)"}
!170 = !{!"Raytracing.hlsl", !"#ifndef RAYTRACING_HLSL\0D\0A#define RAYTRACING_HLSL\0D\0A\0D\0A#define HLSL\0D\0A#include \22RaytracingHLSLCompat.h\22\0D\0A#include \22Random.hlsl\22\0D\0A\0D\0A// Global resources.\0D\0A\0D\0AConstantBuffer<FrameBuffer> g_FrameBuffer : register(b0);\0D\0A\0D\0ARaytracingAccelerationStructure g_Scene : register(t0, space0);\0D\0AStructuredBuffer<int> g_Indices : register(t1, space0);\0D\0AStructuredBuffer<Vertex> g_Vertices : register(t2, space0);\0D\0A\0D\0ARWTexture2D<float4> g_RenderTarget : register(u0);\0D\0A\0D\0A\0D\0A// Local resources.\0D\0A\0D\0AConstantBuffer<MeshBuffer> l_MeshBuffer : register(b1);\0D\0A\0D\0Atypedef BuiltInTriangleIntersectionAttributes MyAttributes;\0D\0Astruct RayPayload\0D\0A{\0D\0A    float4 ColorAndDistance;\0D\0A    float4 ScatterDirection;\0D\0A    uint Seed;\0D\0A};\0D\0A\0D\0Afloat Schlick(in const float COSINE, in const float REFRACTIION_INDEX)\0D\0A{\0D\0A    float r0 = (1.0f - REFRACTIION_INDEX) / (1.0f + REFRACTIION_INDEX);\0D\0A    r0 *= r0;\0D\0A    return r0 + (1.0f - r0) * pow(1.0f - COSINE, 5.0f);\0D\0A}\0D\0A\0D\0A// Retrieve hit world position.\0D\0Afloat3 HitWorldPosition()\0D\0A{\0D\0A    return WorldRayOrigin() + RayTCurrent() * WorldRayDirection();\0D\0A}\0D\0A\0D\0A// Retrieve attribute at a hit position interpolated from vertex attributes using the hit's barycentrics.\0D\0Afloat3 HitAttribute(in float3 vertexAttribute[3], BuiltInTriangleIntersectionAttributes attr)\0D\0A{\0D\0A    return vertexAttribute[0] +\0D\0A        attr.barycentrics.x * (vertexAttribute[1] - vertexAttribute[0]) +\0D\0A        attr.barycentrics.y * (vertexAttribute[2] - vertexAttribute[0]);\0D\0A}\0D\0A\0D\0ARayPayload ScatterLambertian(in float4 albedo, in float3 worldRayDirection, in float3 normal, in float t, in uint seed)\0D\0A{\0D\0A    bool isScattered = (dot(worldRayDirection, normal) < 0.0f);\0D\0A    float4 colorAndDistance = float4(albedo.rgb, t);\0D\0A    float4 scatter = float4(normal + RandomInUnitSphere(seed), isScattered ? 1.0f : 0.0f);\0D\0A\0D\0A    RayPayload payload = (RayPayload) 0;\0D\0A    payload.ColorAndDistance = colorAndDistance;\0D\0A    payload.ScatterDirection = scatter;\0D\0A    payload.Seed = seed;\0D\0A    return payload;\0D\0A}\0D\0A\0D\0ARayPayload ScatterMetal(in float4 albedo, in float3 worldRayDirection, in float3 normal, in float t, in uint seed)\0D\0A{\0D\0A    const float3 REFLECTED = reflect(worldRayDirection, normal);\0D\0A    const bool bIS_SCATTRED = (dot(REFLECTED, normal) > 0.0f);\0D\0A    \0D\0A    const float4 COLOR_AND_DISTANCE = float4(albedo.rgb, t);\0D\0A    const float4 SCATTER = float4(REFLECTED + albedo.w * RandomInUnitSphere(seed), bIS_SCATTRED ? 1.0f : 0.0f);\0D\0A    \0D\0A    RayPayload payload = (RayPayload) 0;\0D\0A    payload.ColorAndDistance = COLOR_AND_DISTANCE;\0D\0A    payload.ScatterDirection = SCATTER;\0D\0A    payload.Seed = seed;\0D\0A    return payload;\0D\0A}\0D\0A\0D\0ARayPayload ScatterDielectric(in float4 albedo, in float3 worldRayDirection, in float3 normal, in float t, in uint seed, in float refractionIndex)\0D\0A{\0D\0A    const float DoN = dot(worldRayDirection, normal);\0D\0A    const float3 OUTWARD_NORMAL = (DoN > 0.0f ? -normal : normal);\0D\0A    const float NI_OVER_NT = (DoN > 0.0f ? refractionIndex : 1.0f / refractionIndex);\0D\0A    const float COSINE = (DoN > 0.0f ? refractionIndex * DoN : -DoN);\0D\0A\0D\0A    const float3 REFRACTED = refract(worldRayDirection, OUTWARD_NORMAL, NI_OVER_NT);\0D\0A    const float REFLECT_PROB = select(REFRACTED != float3(0.0f, 0.0f, 0.0f), Schlick(COSINE, refractionIndex), 1.0f);\0D\0A\0D\0A    const float4 COLOR = float4(1.0f, 1.0f, 1.0f, 1.0f);\0D\0A\09\0D\0A    RayPayload payload = (RayPayload) 0;\0D\0A    payload.ColorAndDistance = float4(COLOR.rgb, t);\0D\0A    payload.ScatterDirection = (RandomFloat(seed) < REFLECT_PROB ? float4(reflect(worldRayDirection, normal), 1.0f) : float4(REFRACTED, 1.0f));\0D\0A    payload.Seed = seed;\0D\0A    return payload;\0D\0A}\0D\0A\0D\0A// Inspired with:\0D\0A// https://github.com/GPSnoopy/RayTracingInVulkan\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid MyRaygenShader()\0D\0A{\0D\0A    uint TotalNumberOfSamples = 10; // TODO: should be in camera\0D\0A    uint randomSeed = InitRandomSeed(InitRandomSeed(DispatchRaysIndex().x, DispatchRaysIndex().y), TotalNumberOfSamples);\0D\0A    uint pixelRandomSeed = 1; // TODO: pass with raypayload\0D\0A    // Generate a ray for a camera pixel corresponding to an index from the dispatched 2D grid.\0D\0A    uint bounces = 8;\0D\0A    float aperture = 0.1f;\0D\0A    float focusDistance = 10.4f;\0D\0A    float3 color = float3(0.0f, 0.0f, 0.0f);\0D\0A    uint3 rayIndex = DispatchRaysIndex();\0D\0A    \0D\0A    for (int sample = 0; sample < TotalNumberOfSamples; ++sample)\0D\0A    {\0D\0A        float3 rayColor = float3(1.0f, 1.0f, 1.0f);\0D\0A       \0D\0A        const float2 PIXEL = float2(DispatchRaysIndex().x + RandomFloat(pixelRandomSeed), DispatchRaysIndex().y + RandomFloat(pixelRandomSeed));\0D\0A        float2 uv = (PIXEL / DispatchRaysDimensions().xy) * 2.0f - 1.0f;\0D\0A        uv.y *= -1.0f; // directx \0D\0A \0D\0A        float2 offset = aperture / 2.0f * RandomInUnitDisk(randomSeed);\0D\0A        float4 origin = mul(float4(offset, 0.0f, 1.0f), g_FrameBuffer.ModelViewInverse);\0D\0A        float4 target = mul((float4(uv.x, uv.y, 1.0f, 1.0f)), g_FrameBuffer.ProjectionToWorld);\0D\0A        float4 direction = mul(float4(normalize(target.xyz * focusDistance - float3(offset, 0.0f)), 0.0f), g_FrameBuffer.ModelViewInverse);\0D\0A       \0D\0A        for (int i = 0; i <= bounces; ++i)\0D\0A        {\0D\0A            if (i == bounces)\0D\0A            {\0D\0A                rayColor = float3(0.0f, 0.0f, 0.0f);\0D\0A                break;\0D\0A            }\0D\0A            \0D\0A            RayDesc ray;\0D\0A            ray.Origin = origin.xyz;\0D\0A            ray.Direction = direction.xyz;\0D\0A            ray.TMin = 0.001f;\0D\0A            ray.TMax = 10000.0f;\0D\0A        \0D\0A            RayPayload payload = (RayPayload) 0;\0D\0A            payload.Seed = randomSeed;\0D\0A\0D\0A            TraceRay(g_Scene, RAY_FLAG_FORCE_OPAQUE, 0xFF, 0, 0, 0, ray, payload);\0D\0A            \0D\0A            const float3 HIT_COLOR = payload.ColorAndDistance.rgb;\0D\0A            const float T = payload.ColorAndDistance.w;\0D\0A            const bool bIS_SCATTERED = (payload.ScatterDirection.w > 0.0f);\0D\0A   \0D\0A            rayColor *= HIT_COLOR;\0D\0A            \0D\0A            if (T < 0.0f || !bIS_SCATTERED)\0D\0A            {\0D\0A                break;\0D\0A            }\0D\0A            \0D\0A            origin = origin + T * direction;\0D\0A            direction = float4(payload.ScatterDirection.xyz, 0.0f);\0D\0A     \0D\0A        }\0D\0A        color += rayColor;\0D\0A    }\0D\0A    \0D\0A    color /= TotalNumberOfSamples;\0D\0A    color = sqrt(color);\0D\0A\0D\0A    // Write the raytraced color to the output texture.\0D\0A    g_RenderTarget[rayIndex.xy].rgb = color;\0D\0A    g_RenderTarget[rayIndex.xy].a = 1.0f;\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid MyClosestHitShader(inout RayPayload payload, in MyAttributes attr)\0D\0A{\0D\0A    float3 hitPosition = HitWorldPosition();\0D\0A    float3 worlRayDirection = WorldRayDirection();\0D\0A \0D\0A    uint indicesPerTriangle = 3;\0D\0A    uint baseIdx = indicesPerTriangle * PrimitiveIndex();\0D\0A    uint indexWithOffset = baseIdx + l_MeshBuffer.IndicesOffset;\0D\0A    \0D\0A    int i0 = g_Indices[indexWithOffset + 0];\0D\0A    int i1 = g_Indices[indexWithOffset + 1];\0D\0A    int i2 = g_Indices[indexWithOffset + 2];\0D\0A\0D\0A    // Retrieve corresponding vertex normals for the triangle vertices.\0D\0A    float3 vertexNormals[3] =\0D\0A    {\0D\0A        g_Vertices[i0 + l_MeshBuffer.VerticesOffset].Normal,\0D\0A        g_Vertices[i1 + l_MeshBuffer.VerticesOffset].Normal,\0D\0A        g_Vertices[i2 + l_MeshBuffer.VerticesOffset].Normal \0D\0A    };\0D\0A\0D\0A    // Compute the triangle's normal.\0D\0A    // This is redundant and done for illustration purposes \0D\0A    // as all the per-vertex normals are the same and match triangle's normal in this sample. \0D\0A    float3 triangleNormal = HitAttribute(vertexNormals, attr);\0D\0A    float t = RayTCurrent();\0D\0A   \0D\0A    int materialId = l_MeshBuffer.MaterialID;\0D\0A    switch (materialId)\0D\0A    {\0D\0A        case 0:\0D\0A            payload = ScatterLambertian(l_MeshBuffer.Albedo, worlRayDirection, triangleNormal, t, payload.Seed);\0D\0A            break;\0D\0A        \0D\0A        case 1:\0D\0A            payload = ScatterMetal(l_MeshBuffer.Albedo, worlRayDirection, triangleNormal, t, payload.Seed);\0D\0A            break;\0D\0A        \0D\0A        case 2:\0D\0A            float refractionIndex = l_MeshBuffer.Albedo.x;\0D\0A            payload = ScatterDielectric(l_MeshBuffer.Albedo, worlRayDirection, triangleNormal, t, payload.Seed, refractionIndex);\0D\0A            break;\0D\0A    }\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid MyMissShader(inout RayPayload payload)\0D\0A{\0D\0A    float a = 0.5f * (normalize(WorldRayDirection().y + 1.0f));\0D\0A    payload.ColorAndDistance.rgb = (1.0f - a) * float3(1.0f, 1.0f, 1.0f) + a * float3(0.5f, 0.7f, 1.0f);\0D\0A    payload.ColorAndDistance.w = -1.0f;\0D\0A}\0D\0A\0D\0A#endif // RAYTRACING_HLSL"}
!171 = !{!".\5CHLSLCompat.h", !"#ifndef HLSLCOMPAT_H\0D\0A#define HLSLCOMPAT_H\0D\0A\0D\0Atypedef float3 XMFLOAT3;\0D\0Atypedef float4 XMFLOAT4;\0D\0Atypedef float4 XMVECTOR;\0D\0Atypedef float4x4 XMMATRIX;\0D\0Atypedef uint UINT;\0D\0A\0D\0A#endif\0D\0A"}
!172 = !{!".\5CRandom.hlsl", !"// CODE FROM: \0D\0A// https://github.com/GPSnoopy/RayTracingInVulkan\0D\0A// Generates a seed for a random number generator from 2 inputs plus a backoff\0D\0A// https://github.com/nvpro-samples/optix_prime_baking/blob/332a886f1ac46c0b3eea9e89a59593470c755a0e/random.h\0D\0A// https://github.com/nvpro-samples/vk_raytracing_tutorial_KHR/tree/master/ray_tracing_jitter_cam\0D\0A// https://en.wikipedia.org/wiki/Tiny_Encryption_Algorithm\0D\0Auint InitRandomSeed(in uint val0, in uint val1)\0D\0A{\0D\0A    uint v0 = val0, v1 = val1, s0 = 0;\0D\0A    \0D\0A    [unroll]\0D\0A    for (uint n = 0; n < 16; n++)\0D\0A    {\0D\0A        s0 += 0x9e3779b9;\0D\0A        v0 += ((v1 << 4) + 0xa341316c) ^ (v1 + s0) ^ ((v1 >> 5) + 0xc8013ea4);\0D\0A        v1 += ((v0 << 4) + 0xad90777d) ^ (v0 + s0) ^ ((v0 >> 5) + 0x7e95761e);\0D\0A    }\0D\0A\0D\0A    return v0;\0D\0A}\0D\0A\0D\0Auint RandomInt(inout uint seed)\0D\0A{\0D\0A\09// LCG values from Numerical Recipes\0D\0A    return (seed = 1664525 * seed + 1013904223);\0D\0A}\0D\0A\0D\0Afloat RandomFloat(inout uint seed)\0D\0A{\0D\0A\09//// Float version using bitmask from Numerical Recipes\0D\0A\09//const uint one = 0x3f800000;\0D\0A\09//const uint msk = 0x007fffff;\0D\0A\09//return uintBitsToFloat(one | (msk & (RandomInt(seed) >> 9))) - 1;\0D\0A\0D\0A\09// Faster version from NVIDIA examples; quality good enough for our use case.\0D\0A    return (float(RandomInt(seed) & 0x00FFFFFF) / float(0x01000000));\0D\0A}\0D\0A\0D\0Afloat3 SampleSquare(in uint seed)\0D\0A{\0D\0A    // Returns the vector to a random point in the [-.5,-.5]-[+.5,+.5] unit square.\0D\0A    return float3(RandomFloat(seed) - 0.5, RandomFloat(seed) - 0.5, 0);\0D\0A}\0D\0A\0D\0Afloat2 RandomInUnitDisk(inout uint seed)\0D\0A{\0D\0A    while (true)\0D\0A    {\0D\0A        const float2 p = 2 * float2(RandomFloat(seed), RandomFloat(seed)) - 1;\0D\0A        if (dot(p, p) < 1)\0D\0A        {\0D\0A            return p;\0D\0A        }\0D\0A    }\0D\0A}\0D\0A\0D\0Afloat3 RandomInUnitSphere(inout uint seed)\0D\0A{\0D\0A    while (true)\0D\0A    {\0D\0A        const float3 p = normalize(2 * float3(RandomFloat(seed), RandomFloat(seed), RandomFloat(seed)) - 1);\0D\0A        if (dot(p, p) < 1)\0D\0A        {\0D\0A            return p;\0D\0A        }\0D\0A    }\0D\0A}"}
!173 = !{!".\5CRaytracingHLSLCompat.h", !"#ifndef RAYTRACINGHLSLCOMPAT_H\0D\0A#define RAYTRACINGHLSLCOMPAT_H\0D\0A\0D\0A#ifdef HLSL\0D\0A#include \22HLSLCompat.h\22\0D\0A#else\0D\0Ausing namespace DirectX;\0D\0Atypedef UINT32 Index;\0D\0A#endif\0D\0A\0D\0Astruct FrameBuffer\0D\0A{\0D\0A\09XMMATRIX ProjectionToWorld;\0D\0A\09XMMATRIX ModelViewInverse;\0D\0A\09XMVECTOR CameraPosition;\0D\0A};\0D\0A\0D\0Astruct MeshBuffer\0D\0A{\0D\0A\09XMFLOAT4 Albedo;\0D\0A\09int MeshID;\0D\0A\09int MaterialID;\0D\0A\09int VerticesOffset;\0D\0A\09int IndicesOffset;\0D\0A};\0D\0A\0D\0Astruct Vertex\0D\0A{\0D\0A\09XMFLOAT3 Position;\0D\0A\09float pad1;\0D\0A\09XMFLOAT3 Normal;\0D\0A\09float pad2;\0D\0A};\0D\0A\0D\0A#endif\0D\0A"}
!174 = !{!"Raytracing.hlsl"}
!175 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_3", !"/Od", !"/Zi", !"-Qembed_debug"}
!176 = !{i32 1, i32 3}
!177 = !{i32 1, i32 7}
!178 = !{!"lib", i32 6, i32 3}
!179 = !{!180, !187, !190, null}
!180 = !{!181, !183, !185}
!181 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?g_Scene@@3URaytracingAccelerationStructure@@A", !"g_Scene", i32 0, i32 0, i32 1, i32 16, i32 0, !182}
!182 = !{i32 0, i32 4}
!183 = !{i32 1, %"class.StructuredBuffer<int>"* @"\01?g_Indices@@3V?$StructuredBuffer@H@@A", !"g_Indices", i32 0, i32 1, i32 1, i32 12, i32 0, !184}
!184 = !{i32 1, i32 4}
!185 = !{i32 2, %"class.StructuredBuffer<Vertex>"* @"\01?g_Vertices@@3V?$StructuredBuffer@UVertex@@@@A", !"g_Vertices", i32 0, i32 2, i32 1, i32 12, i32 0, !186}
!186 = !{i32 1, i32 32}
!187 = !{!188}
!188 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* @"\01?g_RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", !"g_RenderTarget", i32 0, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !189}
!189 = !{i32 0, i32 9}
!190 = !{!191, !192}
!191 = !{i32 0, %hostlayout.g_FrameBuffer* @g_FrameBuffer_legacy, !"g_FrameBuffer", i32 0, i32 0, i32 1, i32 144, null}
!192 = !{i32 1, %l_MeshBuffer* @l_MeshBuffer, !"l_MeshBuffer", i32 0, i32 1, i32 1, i32 32, null}
!193 = !{i32 0, %"class.StructuredBuffer<int>" undef, !194, %"class.StructuredBuffer<Vertex>" undef, !196, %struct.Vertex undef, !198, %struct.MeshBuffer undef, !203, %struct.BuiltInTriangleIntersectionAttributes undef, !209, %struct.RayPayload undef, !211, %l_MeshBuffer undef, !215, %hostlayout.struct.FrameBuffer undef, !217, %hostlayout.g_FrameBuffer undef, !222}
!194 = !{i32 4, !195}
!195 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 4}
!196 = !{i32 32, !197}
!197 = !{i32 6, !"h", i32 3, i32 0}
!198 = !{i32 32, !199, !200, !201, !202}
!199 = !{i32 6, !"Position", i32 3, i32 0, i32 7, i32 9}
!200 = !{i32 6, !"pad1", i32 3, i32 12, i32 7, i32 9}
!201 = !{i32 6, !"Normal", i32 3, i32 16, i32 7, i32 9}
!202 = !{i32 6, !"pad2", i32 3, i32 28, i32 7, i32 9}
!203 = !{i32 32, !204, !205, !206, !207, !208}
!204 = !{i32 6, !"Albedo", i32 3, i32 0, i32 7, i32 9}
!205 = !{i32 6, !"MeshID", i32 3, i32 16, i32 7, i32 4}
!206 = !{i32 6, !"MaterialID", i32 3, i32 20, i32 7, i32 4}
!207 = !{i32 6, !"VerticesOffset", i32 3, i32 24, i32 7, i32 4}
!208 = !{i32 6, !"IndicesOffset", i32 3, i32 28, i32 7, i32 4}
!209 = !{i32 8, !210}
!210 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!211 = !{i32 36, !212, !213, !214}
!212 = !{i32 6, !"ColorAndDistance", i32 3, i32 0, i32 7, i32 9}
!213 = !{i32 6, !"ScatterDirection", i32 3, i32 16, i32 7, i32 9}
!214 = !{i32 6, !"Seed", i32 3, i32 32, i32 7, i32 5}
!215 = !{i32 32, !216}
!216 = !{i32 6, !"l_MeshBuffer", i32 3, i32 0}
!217 = !{i32 144, !218, !220, !221}
!218 = !{i32 6, !"ProjectionToWorld", i32 2, !219, i32 3, i32 0, i32 7, i32 9}
!219 = !{i32 4, i32 4, i32 2}
!220 = !{i32 6, !"ModelViewInverse", i32 2, !219, i32 3, i32 64, i32 7, i32 9}
!221 = !{i32 6, !"CameraPosition", i32 3, i32 128, i32 7, i32 9}
!222 = !{i32 144, !223}
!223 = !{i32 6, !"g_FrameBuffer", i32 3, i32 0}
!224 = !{i32 1, void ()* @"\01?MyRaygenShader@@YAXXZ", !225, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !227, void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z", !230}
!225 = !{!226}
!226 = !{i32 1, !2, !2}
!227 = !{!226, !228, !229}
!228 = !{i32 2, !2, !2}
!229 = !{i32 0, !2, !2}
!230 = !{!226, !228}
!231 = !{null, !"", null, !179, !232}
!232 = !{i32 0, i64 73745}
!233 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !234}
!234 = !{i32 8, i32 10, i32 6, i32 36, i32 7, i32 8, i32 5, !235}
!235 = !{i32 0}
!236 = !{void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z", !"\01?MyMissShader@@YAXURayPayload@@@Z", null, null, !237}
!237 = !{i32 8, i32 11, i32 6, i32 36, i32 5, !235}
!238 = !{void ()* @"\01?MyRaygenShader@@YAXXZ", !"\01?MyRaygenShader@@YAXXZ", null, null, !239}
!239 = !{i32 8, i32 7, i32 5, !235}
!240 = !DILocation(line: 144, column: 13, scope: !241)
!241 = distinct !DILexicalBlock(scope: !242, file: !1, line: 128, column: 9)
!242 = distinct !DILexicalBlock(scope: !243, file: !1, line: 127, column: 9)
!243 = distinct !DILexicalBlock(scope: !244, file: !1, line: 127, column: 9)
!244 = distinct !DILexicalBlock(scope: !245, file: !1, line: 115, column: 5)
!245 = distinct !DILexicalBlock(scope: !246, file: !1, line: 114, column: 5)
!246 = distinct !DILexicalBlock(scope: !83, file: !1, line: 114, column: 5)
!247 = !DILocation(line: 168, column: 5, scope: !83)
!248 = !DILocation(line: 104, column: 10, scope: !83)
!249 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "TotalNumberOfSamples", scope: !83, file: !1, line: 104, type: !36)
!250 = !DIExpression()
!251 = !DILocation(line: 105, column: 76, scope: !83)
!252 = !DILocation(line: 105, column: 53, scope: !83)
!253 = !DILocation(line: 105, column: 38, scope: !83)
!254 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "val1", arg: 2, scope: !32, file: !33, line: 7, type: !36)
!255 = !DILocation(line: 7, column: 43, scope: !32, inlinedAt: !256)
!256 = distinct !DILocation(line: 105, column: 38, scope: !83)
!257 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "val0", arg: 1, scope: !32, file: !33, line: 7, type: !36)
!258 = !DILocation(line: 7, column: 29, scope: !32, inlinedAt: !256)
!259 = !DILocation(line: 9, column: 10, scope: !32, inlinedAt: !256)
!260 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v0", scope: !32, file: !33, line: 9, type: !36)
!261 = !DILocation(line: 9, column: 21, scope: !32, inlinedAt: !256)
!262 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v1", scope: !32, file: !33, line: 9, type: !36)
!263 = !DILocation(line: 9, column: 32, scope: !32, inlinedAt: !256)
!264 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s0", scope: !32, file: !33, line: 9, type: !36)
!265 = !DILocation(line: 12, column: 15, scope: !266, inlinedAt: !256)
!266 = distinct !DILexicalBlock(scope: !32, file: !33, line: 12, column: 5)
!267 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !266, file: !33, line: 12, type: !36)
!268 = !DILocation(line: 12, column: 5, scope: !266, inlinedAt: !256)
!269 = !DILocation(line: 14, column: 12, scope: !270, inlinedAt: !256)
!270 = distinct !DILexicalBlock(scope: !271, file: !33, line: 13, column: 5)
!271 = distinct !DILexicalBlock(scope: !266, file: !33, line: 12, column: 5)
!272 = !DILocation(line: 15, column: 20, scope: !270, inlinedAt: !256)
!273 = !DILocation(line: 15, column: 26, scope: !270, inlinedAt: !256)
!274 = !DILocation(line: 15, column: 46, scope: !270, inlinedAt: !256)
!275 = !DILocation(line: 15, column: 40, scope: !270, inlinedAt: !256)
!276 = !DILocation(line: 15, column: 59, scope: !270, inlinedAt: !256)
!277 = !DILocation(line: 15, column: 65, scope: !270, inlinedAt: !256)
!278 = !DILocation(line: 15, column: 52, scope: !270, inlinedAt: !256)
!279 = !DILocation(line: 15, column: 12, scope: !270, inlinedAt: !256)
!280 = !DILocation(line: 16, column: 20, scope: !270, inlinedAt: !256)
!281 = !DILocation(line: 16, column: 26, scope: !270, inlinedAt: !256)
!282 = !DILocation(line: 16, column: 46, scope: !270, inlinedAt: !256)
!283 = !DILocation(line: 16, column: 40, scope: !270, inlinedAt: !256)
!284 = !DILocation(line: 16, column: 59, scope: !270, inlinedAt: !256)
!285 = !DILocation(line: 16, column: 65, scope: !270, inlinedAt: !256)
!286 = !DILocation(line: 16, column: 52, scope: !270, inlinedAt: !256)
!287 = !DILocation(line: 16, column: 12, scope: !270, inlinedAt: !256)
!288 = !DILocation(line: 12, column: 31, scope: !271, inlinedAt: !256)
!289 = distinct !{!289, !290}
!290 = !{!"llvm.loop.unroll.full"}
!291 = !DILocation(line: 19, column: 5, scope: !32, inlinedAt: !256)
!292 = !DILocation(line: 105, column: 23, scope: !83)
!293 = !DILocation(line: 7, column: 43, scope: !32, inlinedAt: !294)
!294 = distinct !DILocation(line: 105, column: 23, scope: !83)
!295 = !DILocation(line: 7, column: 29, scope: !32, inlinedAt: !294)
!296 = !DILocation(line: 9, column: 10, scope: !32, inlinedAt: !294)
!297 = !DILocation(line: 9, column: 21, scope: !32, inlinedAt: !294)
!298 = !DILocation(line: 9, column: 32, scope: !32, inlinedAt: !294)
!299 = !DILocation(line: 12, column: 15, scope: !266, inlinedAt: !294)
!300 = !DILocation(line: 12, column: 5, scope: !266, inlinedAt: !294)
!301 = !DILocation(line: 14, column: 12, scope: !270, inlinedAt: !294)
!302 = !DILocation(line: 15, column: 12, scope: !270, inlinedAt: !294)
!303 = !DILocation(line: 16, column: 20, scope: !270, inlinedAt: !294)
!304 = !DILocation(line: 16, column: 26, scope: !270, inlinedAt: !294)
!305 = !DILocation(line: 16, column: 46, scope: !270, inlinedAt: !294)
!306 = !DILocation(line: 16, column: 40, scope: !270, inlinedAt: !294)
!307 = !DILocation(line: 16, column: 59, scope: !270, inlinedAt: !294)
!308 = !DILocation(line: 16, column: 65, scope: !270, inlinedAt: !294)
!309 = !DILocation(line: 16, column: 52, scope: !270, inlinedAt: !294)
!310 = !DILocation(line: 16, column: 12, scope: !270, inlinedAt: !294)
!311 = !DILocation(line: 12, column: 31, scope: !271, inlinedAt: !294)
!312 = !DILocation(line: 15, column: 20, scope: !270, inlinedAt: !294)
!313 = !DILocation(line: 15, column: 26, scope: !270, inlinedAt: !294)
!314 = !DILocation(line: 15, column: 46, scope: !270, inlinedAt: !294)
!315 = !DILocation(line: 15, column: 40, scope: !270, inlinedAt: !294)
!316 = !DILocation(line: 15, column: 59, scope: !270, inlinedAt: !294)
!317 = !DILocation(line: 15, column: 65, scope: !270, inlinedAt: !294)
!318 = !DILocation(line: 15, column: 52, scope: !270, inlinedAt: !294)
!319 = !DILocation(line: 19, column: 5, scope: !32, inlinedAt: !294)
!320 = !DILocation(line: 105, column: 10, scope: !83)
!321 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "seed", arg: 1, scope: !38, file: !33, line: 22, type: !36)
!322 = !DILocation(line: 22, column: 27, scope: !38, inlinedAt: !323)
!323 = distinct !DILocation(line: 36, column: 19, scope: !43, inlinedAt: !324)
!324 = distinct !DILocation(line: 49, column: 37, scope: !325, inlinedAt: !326)
!325 = distinct !DILexicalBlock(scope: !49, file: !33, line: 48, column: 5)
!326 = distinct !DILocation(line: 122, column: 43, scope: !244)
!327 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "seed", arg: 1, scope: !43, file: !33, line: 28, type: !36)
!328 = !DILocation(line: 28, column: 30, scope: !43, inlinedAt: !324)
!329 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "seed", arg: 1, scope: !49, file: !33, line: 45, type: !36)
!330 = !DILocation(line: 45, column: 36, scope: !49, inlinedAt: !326)
!331 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "randomSeed", scope: !83, file: !1, line: 105, type: !36)
!332 = !DILocation(line: 106, column: 10, scope: !83)
!333 = !DILocation(line: 22, column: 27, scope: !38, inlinedAt: !334)
!334 = distinct !DILocation(line: 36, column: 19, scope: !43, inlinedAt: !335)
!335 = distinct !DILocation(line: 118, column: 61, scope: !244)
!336 = !DILocation(line: 28, column: 30, scope: !43, inlinedAt: !335)
!337 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pixelRandomSeed", scope: !83, file: !1, line: 106, type: !36)
!338 = !DILocation(line: 108, column: 10, scope: !83)
!339 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bounces", scope: !83, file: !1, line: 108, type: !36)
!340 = !DILocation(line: 109, column: 11, scope: !83)
!341 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aperture", scope: !83, file: !1, line: 109, type: !4)
!342 = !DILocation(line: 110, column: 11, scope: !83)
!343 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "focusDistance", scope: !83, file: !1, line: 110, type: !4)
!344 = !DILocation(line: 111, column: 12, scope: !83)
!345 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "color", scope: !83, file: !1, line: 111, type: !5)
!346 = !DILocation(line: 112, column: 22, scope: !83)
!347 = !DILocation(line: 112, column: 11, scope: !83)
!348 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rayIndex", scope: !83, file: !1, line: 112, type: !349)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 112, baseType: !350)
!350 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 112, size: 96, align: 32, elements: !351, templateParams: !355)
!351 = !{!352, !353, !354}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !350, file: !1, line: 112, baseType: !37, size: 32, align: 32, flags: DIFlagPublic)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !350, file: !1, line: 112, baseType: !37, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !350, file: !1, line: 112, baseType: !37, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!355 = !{!356, !13}
!356 = !DITemplateTypeParameter(name: "element", type: !37)
!357 = !DIExpression(DW_OP_bit_piece, 0, 32)
!358 = !DIExpression(DW_OP_bit_piece, 32, 32)
!359 = !DILocation(line: 114, column: 14, scope: !246)
!360 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sample", scope: !246, file: !1, line: 114, type: !14)
!361 = !DILocation(line: 114, column: 5, scope: !246)
!362 = !DILocation(line: 28, column: 30, scope: !43, inlinedAt: !363)
!363 = distinct !DILocation(line: 118, column: 115, scope: !244)
!364 = !DILocation(line: 22, column: 27, scope: !38, inlinedAt: !365)
!365 = distinct !DILocation(line: 36, column: 19, scope: !43, inlinedAt: !363)
!366 = !DIExpression(DW_OP_bit_piece, 64, 32)
!367 = !DILocation(line: 116, column: 16, scope: !244)
!368 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rayColor", scope: !244, file: !1, line: 116, type: !5)
!369 = !DILocation(line: 118, column: 37, scope: !244)
!370 = !DILocation(line: 118, column: 61, scope: !244)
!371 = !DILocation(line: 36, column: 19, scope: !43, inlinedAt: !335)
!372 = !DILocation(line: 25, column: 28, scope: !38, inlinedAt: !334)
!373 = !DILocation(line: 25, column: 35, scope: !38, inlinedAt: !334)
!374 = !DILocation(line: 25, column: 18, scope: !38, inlinedAt: !334)
!375 = !DILocation(line: 25, column: 5, scope: !38, inlinedAt: !334)
!376 = !DILocation(line: 36, column: 35, scope: !43, inlinedAt: !335)
!377 = !DILocation(line: 36, column: 49, scope: !43, inlinedAt: !335)
!378 = !DILocation(line: 36, column: 5, scope: !43, inlinedAt: !335)
!379 = !DILocation(line: 118, column: 59, scope: !244)
!380 = !DILocation(line: 118, column: 91, scope: !244)
!381 = !DILocation(line: 118, column: 115, scope: !244)
!382 = !DILocation(line: 36, column: 19, scope: !43, inlinedAt: !363)
!383 = !DILocation(line: 25, column: 28, scope: !38, inlinedAt: !365)
!384 = !DILocation(line: 25, column: 35, scope: !38, inlinedAt: !365)
!385 = !DILocation(line: 25, column: 18, scope: !38, inlinedAt: !365)
!386 = !DILocation(line: 25, column: 5, scope: !38, inlinedAt: !365)
!387 = !DILocation(line: 36, column: 35, scope: !43, inlinedAt: !363)
!388 = !DILocation(line: 36, column: 49, scope: !43, inlinedAt: !363)
!389 = !DILocation(line: 36, column: 5, scope: !43, inlinedAt: !363)
!390 = !DILocation(line: 118, column: 113, scope: !244)
!391 = !DILocation(line: 118, column: 22, scope: !244)
!392 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "PIXEL", scope: !244, file: !1, line: 118, type: !393)
!393 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!394 = !DILocation(line: 119, column: 30, scope: !244)
!395 = !DILocation(line: 119, column: 28, scope: !244)
!396 = !DILocation(line: 119, column: 59, scope: !244)
!397 = !DILocation(line: 119, column: 66, scope: !244)
!398 = !DILocation(line: 119, column: 16, scope: !244)
!399 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uv", scope: !244, file: !1, line: 119, type: !15)
!400 = !DILocation(line: 120, column: 14, scope: !244)
!401 = !DILocation(line: 122, column: 43, scope: !244)
!402 = !DILocation(line: 47, column: 5, scope: !49, inlinedAt: !326)
!403 = !DILocation(line: 28, column: 30, scope: !43, inlinedAt: !404)
!404 = distinct !DILocation(line: 49, column: 56, scope: !325, inlinedAt: !326)
!405 = !DILocation(line: 22, column: 27, scope: !38, inlinedAt: !406)
!406 = distinct !DILocation(line: 36, column: 19, scope: !43, inlinedAt: !404)
!407 = !DILocation(line: 49, column: 37, scope: !325, inlinedAt: !326)
!408 = !DILocation(line: 36, column: 19, scope: !43, inlinedAt: !324)
!409 = !DILocation(line: 25, column: 28, scope: !38, inlinedAt: !323)
!410 = !DILocation(line: 25, column: 35, scope: !38, inlinedAt: !323)
!411 = !DILocation(line: 25, column: 18, scope: !38, inlinedAt: !323)
!412 = !DILocation(line: 25, column: 5, scope: !38, inlinedAt: !323)
!413 = !DILocation(line: 36, column: 35, scope: !43, inlinedAt: !324)
!414 = !DILocation(line: 36, column: 49, scope: !43, inlinedAt: !324)
!415 = !DILocation(line: 36, column: 5, scope: !43, inlinedAt: !324)
!416 = !DILocation(line: 49, column: 56, scope: !325, inlinedAt: !326)
!417 = !DILocation(line: 36, column: 19, scope: !43, inlinedAt: !404)
!418 = !DILocation(line: 25, column: 28, scope: !38, inlinedAt: !406)
!419 = !DILocation(line: 25, column: 35, scope: !38, inlinedAt: !406)
!420 = !DILocation(line: 25, column: 18, scope: !38, inlinedAt: !406)
!421 = !DILocation(line: 25, column: 5, scope: !38, inlinedAt: !406)
!422 = !DILocation(line: 36, column: 35, scope: !43, inlinedAt: !404)
!423 = !DILocation(line: 36, column: 49, scope: !43, inlinedAt: !404)
!424 = !DILocation(line: 36, column: 5, scope: !43, inlinedAt: !404)
!425 = !DILocation(line: 49, column: 28, scope: !325, inlinedAt: !326)
!426 = !DILocation(line: 49, column: 75, scope: !325, inlinedAt: !326)
!427 = !DILocation(line: 49, column: 22, scope: !325, inlinedAt: !326)
!428 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !325, file: !33, line: 49, type: !393)
!429 = !DILocation(line: 50, column: 13, scope: !430, inlinedAt: !326)
!430 = distinct !DILexicalBlock(scope: !325, file: !33, line: 50, column: 13)
!431 = !DILocation(line: 50, column: 23, scope: !430, inlinedAt: !326)
!432 = !DILocation(line: 50, column: 13, scope: !325, inlinedAt: !326)
!433 = !DILocation(line: 52, column: 13, scope: !434, inlinedAt: !326)
!434 = distinct !DILexicalBlock(scope: !430, file: !33, line: 51, column: 9)
!435 = !DILocation(line: 122, column: 41, scope: !244)
!436 = !DILocation(line: 122, column: 16, scope: !244)
!437 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset", scope: !244, file: !1, line: 122, type: !15)
!438 = !DILocation(line: 123, column: 71, scope: !244)
!439 = !DILocation(line: 123, column: 25, scope: !244)
!440 = !DILocation(line: 123, column: 16, scope: !244)
!441 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "origin", scope: !244, file: !1, line: 123, type: !22)
!442 = !DILocation(line: 124, column: 77, scope: !244)
!443 = !DILocation(line: 124, column: 25, scope: !244)
!444 = !DILocation(line: 124, column: 16, scope: !244)
!445 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "target", scope: !244, file: !1, line: 124, type: !22)
!446 = !DILocation(line: 125, column: 122, scope: !244)
!447 = !DILocation(line: 125, column: 60, scope: !244)
!448 = !DILocation(line: 125, column: 76, scope: !244)
!449 = !DILocation(line: 125, column: 39, scope: !244)
!450 = !DILocation(line: 125, column: 28, scope: !244)
!451 = !DILocation(line: 125, column: 16, scope: !244)
!452 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "direction", scope: !244, file: !1, line: 125, type: !22)
!453 = !DILocation(line: 127, column: 18, scope: !243)
!454 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !243, file: !1, line: 127, type: !14)
!455 = !DILocation(line: 127, column: 9, scope: !243)
!456 = !DILocation(line: 129, column: 19, scope: !457)
!457 = distinct !DILexicalBlock(scope: !241, file: !1, line: 129, column: 17)
!458 = !DILocation(line: 129, column: 17, scope: !241)
!459 = !DILocation(line: 131, column: 26, scope: !460)
!460 = distinct !DILexicalBlock(scope: !457, file: !1, line: 130, column: 13)
!461 = !DILocation(line: 132, column: 17, scope: !460)
!462 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ray", scope: !241, file: !1, line: 135, type: !463)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 135, size: 256, align: 32, elements: !464)
!464 = !{!465, !466, !467, !468}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !463, file: !1, line: 135, baseType: !6, size: 96, align: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !463, file: !1, line: 135, baseType: !4, size: 32, align: 32, offset: 96)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !463, file: !1, line: 135, baseType: !6, size: 96, align: 32, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !463, file: !1, line: 135, baseType: !4, size: 32, align: 32, offset: 224)
!469 = !DILocation(line: 135, column: 21, scope: !241)
!470 = !DILocation(line: 136, column: 26, scope: !241)
!471 = !DILocation(line: 136, column: 17, scope: !241)
!472 = !DILocation(line: 136, column: 24, scope: !241)
!473 = !DILocation(line: 137, column: 29, scope: !241)
!474 = !DILocation(line: 137, column: 17, scope: !241)
!475 = !DILocation(line: 137, column: 27, scope: !241)
!476 = !DILocation(line: 138, column: 17, scope: !241)
!477 = !DILocation(line: 138, column: 22, scope: !241)
!478 = !DILocation(line: 139, column: 17, scope: !241)
!479 = !DILocation(line: 139, column: 22, scope: !241)
!480 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "payload", scope: !241, file: !1, line: 141, type: !74)
!481 = !DILocation(line: 141, column: 24, scope: !241)
!482 = !DILocation(line: 141, column: 47, scope: !241)
!483 = !DILocation(line: 142, column: 21, scope: !241)
!484 = !DILocation(line: 142, column: 26, scope: !241)
!485 = !DILocation(line: 146, column: 46, scope: !241)
!486 = !DILocation(line: 146, column: 38, scope: !241)
!487 = !DILocation(line: 146, column: 26, scope: !241)
!488 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "HIT_COLOR", scope: !241, file: !1, line: 146, type: !489)
!489 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!490 = !DILocation(line: 147, column: 37, scope: !241)
!491 = !DILocation(line: 147, column: 29, scope: !241)
!492 = !DILocation(line: 147, column: 25, scope: !241)
!493 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "T", scope: !241, file: !1, line: 147, type: !58)
!494 = !DILocation(line: 148, column: 49, scope: !241)
!495 = !DILocation(line: 148, column: 41, scope: !241)
!496 = !DILocation(line: 148, column: 68, scope: !241)
!497 = !DILocation(line: 148, column: 24, scope: !241)
!498 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bIS_SCATTERED", scope: !241, file: !1, line: 148, type: !499)
!499 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !500)
!500 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!501 = !DILocation(line: 150, column: 22, scope: !241)
!502 = !DILocation(line: 152, column: 19, scope: !503)
!503 = distinct !DILexicalBlock(scope: !241, file: !1, line: 152, column: 17)
!504 = !DILocation(line: 152, column: 26, scope: !503)
!505 = !DILocation(line: 152, column: 30, scope: !503)
!506 = !DILocation(line: 152, column: 17, scope: !241)
!507 = !DILocation(line: 154, column: 17, scope: !508)
!508 = distinct !DILexicalBlock(scope: !503, file: !1, line: 153, column: 13)
!509 = !DILocation(line: 157, column: 31, scope: !241)
!510 = !DILocation(line: 157, column: 33, scope: !241)
!511 = !DILocation(line: 157, column: 29, scope: !241)
!512 = !DILocation(line: 157, column: 20, scope: !241)
!513 = !DILocation(line: 158, column: 40, scope: !241)
!514 = !DILocation(line: 158, column: 32, scope: !241)
!515 = !DILocation(line: 158, column: 23, scope: !241)
!516 = !DIExpression(DW_OP_bit_piece, 96, 32)
!517 = !DILocation(line: 160, column: 9, scope: !241)
!518 = !DILocation(line: 127, column: 39, scope: !242)
!519 = !DILocation(line: 127, column: 27, scope: !242)
!520 = !DILocation(line: 161, column: 15, scope: !244)
!521 = !DILocation(line: 162, column: 5, scope: !244)
!522 = !DILocation(line: 114, column: 57, scope: !245)
!523 = !DILocation(line: 114, column: 33, scope: !245)
!524 = !DILocation(line: 164, column: 11, scope: !83)
!525 = !DILocation(line: 165, column: 13, scope: !83)
!526 = !DILocation(line: 165, column: 11, scope: !83)
!527 = !DILocation(line: 168, column: 37, scope: !83)
!528 = !DILocation(line: 169, column: 5, scope: !83)
!529 = !DILocation(line: 169, column: 35, scope: !83)
!530 = !DILocation(line: 170, column: 1, scope: !83)
!531 = !DILocation(line: 189, column: 9, scope: !86)
!532 = !DILocation(line: 182, column: 14, scope: !86)
!533 = !DILocation(line: 173, column: 42, scope: !86)
