#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;       Typed UAV Load Additional Formats
;
; shader debug name: 3aa6f5cb9b668c9b879632cc2e66ec4d.pdb
; shader hash: 3aa6f5cb9b668c9b879632cc2e66ec4d
;
; Buffer Definitions:
;
; cbuffer g_FrameBuffer
; {
;
;   struct hostlayout.g_FrameBuffer
;   {
;
;       struct hostlayout.struct.FrameBuffer
;       {
;
;           column_major float4x4 ProjectionToWorld;  ; Offset:    0
;           column_major float4x4 ModelViewInverse;   ; Offset:   64
;           float4 CameraPosition;                    ; Offset:  128
;       
;       } g_FrameBuffer;                              ; Offset:    0
;
;   
;   } g_FrameBuffer;                                  ; Offset:    0 Size:   144
;
; }
;
; cbuffer l_MeshBuffer
; {
;
;   struct l_MeshBuffer
;   {
;
;       struct struct.MeshBuffer
;       {
;
;           float4 Albedo;                            ; Offset:    0
;           int MeshID;                               ; Offset:   16
;           int MaterialID;                           ; Offset:   20
;           int VerticesOffset;                       ; Offset:   24
;           int IndicesOffset;                        ; Offset:   28
;       
;       } l_MeshBuffer;                               ; Offset:    0
;
;   
;   } l_MeshBuffer;                                   ; Offset:    0 Size:    32
;
; }
;
; Resource bind info for g_Indices
; {
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.7.2308.16 (52da17e29)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !46, globals: !109)
!1 = !DIFile(filename: "Raytracing.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !5, !15, !22, !31}
!4 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 37, baseType: !6)
!6 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 37, size: 96, align: 32, elements: !7, templateParams: !11)
!7 = !{!8, !9, !10}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !6, file: !1, line: 37, baseType: !4, size: 32, align: 32, flags: DIFlagPublic)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !6, file: !1, line: 37, baseType: !4, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !6, file: !1, line: 37, baseType: !4, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !4)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 43, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 43, size: 64, align: 32, elements: !17, templateParams: !20)
!17 = !{!18, !19}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, line: 43, baseType: !4, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, line: 43, baseType: !4, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !{!12, !21}
!21 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 51, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 51, size: 128, align: 32, elements: !24, templateParams: !29)
!24 = !{!25, !26, !27, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 51, baseType: !4, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 51, baseType: !4, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, line: 51, baseType: !4, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !23, file: !1, line: 51, baseType: !4, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!29 = !{!12, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 4)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 188, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 188, size: 288, align: 32, elements: !33, templateParams: !43)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !32, file: !1, line: 188, baseType: !4, size: 32, align: 32, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !32, file: !1, line: 188, baseType: !4, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !32, file: !1, line: 188, baseType: !4, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !32, file: !1, line: 188, baseType: !4, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !32, file: !1, line: 188, baseType: !4, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !32, file: !1, line: 188, baseType: !4, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !32, file: !1, line: 188, baseType: !4, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !32, file: !1, line: 188, baseType: !4, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !32, file: !1, line: 188, baseType: !4, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!43 = !{!12, !44, !45}
!44 = !DITemplateValueParameter(name: "row_count", type: !14, value: i32 3)
!45 = !DITemplateValueParameter(name: "col_count", type: !14, value: i32 3)
!46 = !{!47, !53, !58, !61, !64, !67, !70, !74, !77, !86, !94, !95, !98, !101, !106}
!47 = !DISubprogram(name: "InitRandomSeed", linkageName: "\01?InitRandomSeed@@YAIII@Z", scope: !48, file: !48, line: 7, type: !49, isLocal: false, isDefinition: true, scopeLine: 8, flags: DIFlagPrototyped, isOptimized: false)
!48 = !DIFile(filename: "./Random.hlsl", directory: "")
!49 = !DISubroutineType(types: !50)
!50 = !{!51, !51, !51}
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !52)
!52 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!53 = !DISubprogram(name: "RandomInt", linkageName: "\01?RandomInt@@YAIAIAI@Z", scope: !48, file: !48, line: 22, type: !54, isLocal: false, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: false)
!54 = !DISubroutineType(types: !55)
!55 = !{!51, !56}
!56 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !57)
!57 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !51)
!58 = !DISubprogram(name: "RandomFloat", linkageName: "\01?RandomFloat@@YAMAIAI@Z", scope: !48, file: !48, line: 28, type: !59, isLocal: false, isDefinition: true, scopeLine: 29, flags: DIFlagPrototyped, isOptimized: false)
!59 = !DISubroutineType(types: !60)
!60 = !{!4, !56}
!61 = !DISubprogram(name: "SampleSquare", linkageName: "\01?SampleSquare@@YA?AV?$vector@M$02@@I@Z", scope: !48, file: !48, line: 39, type: !62, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: false)
!62 = !DISubroutineType(types: !63)
!63 = !{!5, !51}
!64 = !DISubprogram(name: "RandomInUnitDisk", linkageName: "\01?RandomInUnitDisk@@YA?AV?$vector@M$01@@AIAI@Z", scope: !48, file: !48, line: 45, type: !65, isLocal: false, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: false)
!65 = !DISubroutineType(types: !66)
!66 = !{!15, !56}
!67 = !DISubprogram(name: "RandomInUnitSphere", linkageName: "\01?RandomInUnitSphere@@YA?AV?$vector@M$02@@AIAI@Z", scope: !48, file: !48, line: 57, type: !68, isLocal: false, isDefinition: true, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: false)
!68 = !DISubroutineType(types: !69)
!69 = !{!5, !56}
!70 = !DISubprogram(name: "Schlick", linkageName: "\01?Schlick@@YAMMM@Z", scope: !1, file: !1, line: 32, type: !71, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: false)
!71 = !DISubroutineType(types: !72)
!72 = !{!4, !73, !73}
!73 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!74 = !DISubprogram(name: "HitWorldPosition", linkageName: "\01?HitWorldPosition@@YA?AV?$vector@M$02@@XZ", scope: !1, file: !1, line: 40, type: !75, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: false)
!75 = !DISubroutineType(types: !76)
!76 = !{!5}
!77 = !DISubprogram(name: "HitAttribute", linkageName: "\01?HitAttribute@@YA?AV?$vector@M$02@@Y02V1@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 46, type: !78, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false)
!78 = !DISubroutineType(types: !79)
!79 = !{!5, !80, !83}
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 288, align: 32, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 3)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 43, size: 64, align: 32, elements: !84)
!84 = !{!85}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !83, file: !1, line: 43, baseType: !16, size: 64, align: 32)
!86 = !DISubprogram(name: "ScatterLambertian", linkageName: "\01?ScatterLambertian@@YA?AURayPayload@@V?$vector@M$03@@V?$vector@M$02@@1MI@Z", scope: !1, file: !1, line: 53, type: !87, isLocal: false, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped, isOptimized: false)
!87 = !DISubroutineType(types: !88)
!88 = !{!89, !22, !5, !5, !4, !51}
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayPayload", file: !1, line: 25, size: 288, align: 32, elements: !90)
!90 = !{!91, !92, !93}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "ColorAndDistance", scope: !89, file: !1, line: 27, baseType: !22, size: 128, align: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "ScatterDirection", scope: !89, file: !1, line: 28, baseType: !22, size: 128, align: 32, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "Seed", scope: !89, file: !1, line: 29, baseType: !51, size: 32, align: 32, offset: 256)
!94 = !DISubprogram(name: "ScatterMetal", linkageName: "\01?ScatterMetal@@YA?AURayPayload@@V?$vector@M$03@@V?$vector@M$02@@1MI@Z", scope: !1, file: !1, line: 66, type: !87, isLocal: false, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false)
!95 = !DISubprogram(name: "ScatterDielectric", linkageName: "\01?ScatterDielectric@@YA?AURayPayload@@V?$vector@M$03@@V?$vector@M$02@@1MIM@Z", scope: !1, file: !1, line: 81, type: !96, isLocal: false, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: false)
!96 = !DISubroutineType(types: !97)
!97 = !{!89, !22, !5, !5, !4, !51, !4}
!98 = !DISubprogram(name: "MyRaygenShader", linkageName: "\01?MyRaygenShader@@YAXXZ", scope: !1, file: !1, line: 103, type: !99, isLocal: false, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?MyRaygenShader@@YAXXZ")
!99 = !DISubroutineType(types: !100)
!100 = !{null}
!101 = !DISubprogram(name: "MyClosestHitShader", linkageName: "\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 174, type: !102, isLocal: false, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!102 = !DISubroutineType(types: !103)
!103 = !{null, !104, !105}
!104 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !89)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "MyAttributes", file: !1, line: 24, baseType: !83)
!106 = !DISubprogram(name: "MyMissShader", linkageName: "\01?MyMissShader@@YAXURayPayload@@@Z", scope: !1, file: !1, line: 223, type: !107, isLocal: false, isDefinition: true, scopeLine: 224, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z")
!107 = !DISubroutineType(types: !108)
!108 = !{null, !104}
!109 = !{!110, !112, !114, !149, !151, !155, !166, !170}
!110 = !DIGlobalVariable(name: "COLOR", scope: !95, file: !1, line: 91, type: !111, isLocal: true, isDefinition: true)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!112 = !DIGlobalVariable(name: "RAY_FLAG_FORCE_OPAQUE", scope: !0, file: !1, line: 145, type: !113, isLocal: true, isDefinition: true, variable: i32 1)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!114 = !DIGlobalVariable(name: "g_FrameBuffer", linkageName: "\01?g_FrameBuffer@@3U?$ConstantBuffer@UFrameBuffer@@@@A", scope: !0, file: !1, line: 10, type: !115, isLocal: false, isDefinition: true)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<FrameBuffer>", file: !1, line: 10, size: 32, align: 32, elements: !2, templateParams: !116)
!116 = !{!117}
!117 = !DITemplateTypeParameter(name: "T", type: !118)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "FrameBuffer", file: !119, line: 11, size: 1152, align: 32, elements: !120)
!119 = !DIFile(filename: "./RaytracingHLSLCompat.h", directory: "")
!120 = !{!121, !146, !147}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "ProjectionToWorld", scope: !118, file: !119, line: 13, baseType: !122, size: 512, align: 32)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMMATRIX", file: !123, line: 7, baseType: !124)
!123 = !DIFile(filename: "./HLSLCompat.h", directory: "")
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 10, baseType: !125)
!125 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 10, size: 512, align: 32, elements: !126, templateParams: !143)
!126 = !{!127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !125, file: !1, line: 10, baseType: !4, size: 32, align: 32, flags: DIFlagPublic)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !125, file: !1, line: 10, baseType: !4, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !125, file: !1, line: 10, baseType: !4, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !125, file: !1, line: 10, baseType: !4, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !125, file: !1, line: 10, baseType: !4, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !125, file: !1, line: 10, baseType: !4, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !125, file: !1, line: 10, baseType: !4, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !125, file: !1, line: 10, baseType: !4, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !125, file: !1, line: 10, baseType: !4, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !125, file: !1, line: 10, baseType: !4, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !125, file: !1, line: 10, baseType: !4, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !125, file: !1, line: 10, baseType: !4, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !125, file: !1, line: 10, baseType: !4, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !125, file: !1, line: 10, baseType: !4, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !125, file: !1, line: 10, baseType: !4, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !125, file: !1, line: 10, baseType: !4, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!143 = !{!12, !144, !145}
!144 = !DITemplateValueParameter(name: "row_count", type: !14, value: i32 4)
!145 = !DITemplateValueParameter(name: "col_count", type: !14, value: i32 4)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "ModelViewInverse", scope: !118, file: !119, line: 14, baseType: !122, size: 512, align: 32, offset: 512)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "CameraPosition", scope: !118, file: !119, line: 15, baseType: !148, size: 128, align: 32, offset: 1024)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMVECTOR", file: !123, line: 6, baseType: !22)
!149 = !DIGlobalVariable(name: "g_Scene", linkageName: "\01?g_Scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 12, type: !150, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?g_Scene@@3URaytracingAccelerationStructure@@A")
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 12, size: 32, align: 32, elements: !2)
!151 = !DIGlobalVariable(name: "g_Indices", linkageName: "\01?g_Indices@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 13, type: !152, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<unsigned int>"* @"\01?g_Indices@@3V?$StructuredBuffer@I@@A")
!152 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<unsigned int>", file: !1, line: 13, size: 32, align: 32, elements: !2, templateParams: !153)
!153 = !{!154}
!154 = !DITemplateTypeParameter(name: "element", type: !52)
!155 = !DIGlobalVariable(name: "g_Vertices", linkageName: "\01?g_Vertices@@3V?$StructuredBuffer@UVertex@@@@A", scope: !0, file: !1, line: 14, type: !156, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<Vertex>"* @"\01?g_Vertices@@3V?$StructuredBuffer@UVertex@@@@A")
!156 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<Vertex>", file: !1, line: 14, size: 256, align: 32, elements: !2, templateParams: !157)
!157 = !{!158}
!158 = !DITemplateTypeParameter(name: "element", type: !159)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vertex", file: !119, line: 27, size: 256, align: 32, elements: !160)
!160 = !{!161, !163, !164, !165}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !159, file: !119, line: 29, baseType: !162, size: 96, align: 32)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !123, line: 4, baseType: !5)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !159, file: !119, line: 30, baseType: !4, size: 32, align: 32, offset: 96)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "Normal", scope: !159, file: !119, line: 31, baseType: !162, size: 96, align: 32, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !159, file: !119, line: 32, baseType: !4, size: 32, align: 32, offset: 224)
!166 = !DIGlobalVariable(name: "g_RenderTarget", linkageName: "\01?g_RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 16, type: !167, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?g_RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!167 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 16, size: 128, align: 32, elements: !2, templateParams: !168)
!168 = !{!169}
!169 = !DITemplateTypeParameter(name: "element", type: !23)
!170 = !DIGlobalVariable(name: "l_MeshBuffer", linkageName: "\01?l_MeshBuffer@@3U?$ConstantBuffer@UMeshBuffer@@@@A", scope: !0, file: !1, line: 21, type: !171, isLocal: false, isDefinition: true)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<MeshBuffer>", file: !1, line: 21, size: 32, align: 32, elements: !2, templateParams: !172)
!172 = !{!173}
!173 = !DITemplateTypeParameter(name: "T", type: !174)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshBuffer", file: !119, line: 18, size: 256, align: 32, elements: !175)
!175 = !{!176, !178, !179, !180, !181}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "Albedo", scope: !174, file: !119, line: 20, baseType: !177, size: 128, align: 32)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT4", file: !123, line: 5, baseType: !22)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "MeshID", scope: !174, file: !119, line: 21, baseType: !14, size: 32, align: 32, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "MaterialID", scope: !174, file: !119, line: 22, baseType: !14, size: 32, align: 32, offset: 160)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "VerticesOffset", scope: !174, file: !119, line: 23, baseType: !14, size: 32, align: 32, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "IndicesOffset", scope: !174, file: !119, line: 24, baseType: !14, size: 32, align: 32, offset: 224)
!182 = !{i32 2, !"Dwarf Version", i32 4}
!183 = !{i32 2, !"Debug Info Version", i32 3}
!184 = !{!"dxcoob 1.7.2308.16 (52da17e29)"}
!185 = !{!"Raytracing.hlsl", !"#ifndef RAYTRACING_HLSL\0D\0A#define RAYTRACING_HLSL\0D\0A\0D\0A#define HLSL\0D\0A#include \22RaytracingHLSLCompat.h\22\0D\0A#include \22Random.hlsl\22\0D\0A\0D\0A// Global resources.\0D\0A\0D\0AConstantBuffer<FrameBuffer> g_FrameBuffer : register(b0);\0D\0A\0D\0ARaytracingAccelerationStructure g_Scene : register(t0, space0);\0D\0AStructuredBuffer<uint> g_Indices : register(t1, space0);\0D\0AStructuredBuffer<Vertex> g_Vertices : register(t2, space0);\0D\0A\0D\0ARWTexture2D<float4> g_RenderTarget : register(u0);\0D\0A\0D\0A\0D\0A// Local resources.\0D\0A\0D\0AConstantBuffer<MeshBuffer> l_MeshBuffer : register(b1);\0D\0A\0D\0A\0D\0Atypedef BuiltInTriangleIntersectionAttributes MyAttributes;\0D\0Astruct RayPayload\0D\0A{\0D\0A    float4 ColorAndDistance;\0D\0A    float4 ScatterDirection;\0D\0A    uint Seed;\0D\0A};\0D\0A\0D\0Afloat Schlick(in const float COSINE, in const float REFRACTIION_INDEX)\0D\0A{\0D\0A    float r0 = (1.0f - REFRACTIION_INDEX) / (1.0f + REFRACTIION_INDEX);\0D\0A    r0 *= r0;\0D\0A    return r0 + (1.0f - r0) * pow(1.0f - COSINE, 5.0f);\0D\0A}\0D\0A\0D\0A// Retrieve hit world position.\0D\0Afloat3 HitWorldPosition()\0D\0A{\0D\0A    return WorldRayOrigin() + RayTCurrent() * WorldRayDirection();\0D\0A}\0D\0A\0D\0A// Retrieve attribute at a hit position interpolated from vertex attributes using the hit's barycentrics.\0D\0Afloat3 HitAttribute(in float3 vertexAttribute[3], BuiltInTriangleIntersectionAttributes attr)\0D\0A{\0D\0A    return vertexAttribute[0] +\0D\0A        attr.barycentrics.x * (vertexAttribute[1] - vertexAttribute[0]) +\0D\0A        attr.barycentrics.y * (vertexAttribute[2] - vertexAttribute[0]);\0D\0A}\0D\0A\0D\0ARayPayload ScatterLambertian(in float4 albedo, in float3 worldRayDirection, in float3 normal, in float t, in uint seed)\0D\0A{\0D\0A    bool isScattered = (dot(worldRayDirection, normal) < 0.0f);\0D\0A    float4 colorAndDistance = float4(albedo.rgb, t);\0D\0A    float4 scatter = float4(normal + RandomInUnitSphere(seed), isScattered ? 1.0f : 0.0f);\0D\0A\0D\0A    RayPayload payload = (RayPayload) 0;\0D\0A    payload.ColorAndDistance = colorAndDistance;\0D\0A    payload.ScatterDirection = scatter;\0D\0A    payload.Seed = seed;\0D\0A    return payload;\0D\0A}\0D\0A\0D\0ARayPayload ScatterMetal(in float4 albedo, in float3 worldRayDirection, in float3 normal, in float t, in uint seed)\0D\0A{\0D\0A    const float3 REFLECTED = reflect(worldRayDirection, normal);\0D\0A    const bool bIS_SCATTRED = (dot(REFLECTED, normal) > 0.0f);\0D\0A    \0D\0A    const float4 COLOR_AND_DISTANCE = float4(albedo.rgb, t);\0D\0A    const float4 SCATTER = float4(REFLECTED + albedo.w * RandomInUnitSphere(seed), bIS_SCATTRED ? 1.0f : 0.0f);\0D\0A    \0D\0A    RayPayload payload = (RayPayload) 0;\0D\0A    payload.ColorAndDistance = COLOR_AND_DISTANCE;\0D\0A    payload.ScatterDirection = SCATTER;\0D\0A    payload.Seed = seed;\0D\0A    return payload;\0D\0A}\0D\0A\0D\0ARayPayload ScatterDielectric(in float4 albedo, in float3 worldRayDirection, in float3 normal, in float t, in uint seed, in float refractionIndex)\0D\0A{\0D\0A    const float DoN = dot(worldRayDirection, normal);\0D\0A    const float3 OUTWARD_NORMAL = (DoN > 0.0f ? -normal : normal);\0D\0A    const float NI_OVER_NT = (DoN > 0.0f ? refractionIndex : 1.0f / refractionIndex);\0D\0A    const float COSINE = (DoN > 0.0f ? refractionIndex * DoN : -DoN);\0D\0A\0D\0A    const float3 REFRACTED = refract(worldRayDirection, OUTWARD_NORMAL, NI_OVER_NT);\0D\0A    const float REFLECT_PROB = select(REFRACTED != float3(0.0f, 0.0f, 0.0f), Schlick(COSINE, refractionIndex), 1.0f);\0D\0A\0D\0A    const float4 COLOR = float4(1.0f, 1.0f, 1.0f, 1.0f);\0D\0A\09\0D\0A    RayPayload payload = (RayPayload) 0;\0D\0A    payload.ColorAndDistance = float4(COLOR.rgb, t);\0D\0A    payload.ScatterDirection = (RandomFloat(seed) < REFLECT_PROB ? float4(reflect(worldRayDirection, normal), 1.0f) : float4(REFRACTED, 1.0f));\0D\0A    payload.Seed = seed;\0D\0A    return payload;\0D\0A}\0D\0A\0D\0A// Inspired with:\0D\0A// https://github.com/GPSnoopy/RayTracingInVulkan\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid MyRaygenShader()\0D\0A{\0D\0A    uint TotalNumberOfSamples = 5; // TODO: should be in camera\0D\0A    uint randomSeed = InitRandomSeed(InitRandomSeed(DispatchRaysIndex().x, DispatchRaysIndex().y), TotalNumberOfSamples);\0D\0A    uint pixelRandomSeed = 1; // TODO: pass with raypayload\0D\0A    // Generate a ray for a camera pixel corresponding to an index from the dispatched 2D grid.\0D\0A    uint bounces = 8;\0D\0A    float aperture = 0.1f;\0D\0A    float focusDistance = 10.4f;\0D\0A    float3 color = float3(0.0f, 0.0f, 0.0f);\0D\0A    uint3 rayIndex = DispatchRaysIndex();\0D\0A    \0D\0A    for (int sample = 0; sample < TotalNumberOfSamples; ++sample)\0D\0A    {\0D\0A        float3 rayColor = float3(1.0f, 1.0f, 1.0f);\0D\0A       \0D\0A        const float2 PIXEL = float2(DispatchRaysIndex().x + RandomFloat(pixelRandomSeed), DispatchRaysIndex().y + RandomFloat(pixelRandomSeed));\0D\0A        float2 uv = (PIXEL / DispatchRaysDimensions().xy) * 2.0f - 1.0f;\0D\0A        uv.y *= -1.0f; // directx \0D\0A \0D\0A        float2 offset = aperture / 2.0f * RandomInUnitDisk(randomSeed);\0D\0A        float4 origin = mul(float4(offset, 0.0f, 1.0f), g_FrameBuffer.ModelViewInverse);\0D\0A        float4 target = mul((float4(uv.x, uv.y, 1.0f, 1.0f)), g_FrameBuffer.ProjectionToWorld);\0D\0A        float4 direction = mul(float4(normalize(target.xyz * focusDistance - float3(offset, 0.0f)), 0.0f), g_FrameBuffer.ModelViewInverse);\0D\0A       \0D\0A        for (int i = 0; i <= bounces; ++i)\0D\0A        {\0D\0A            if (i == bounces)\0D\0A            {\0D\0A                rayColor = float3(0.0f, 0.0f, 0.0f);\0D\0A                break;\0D\0A            }\0D\0A            \0D\0A            RayDesc ray;\0D\0A            ray.Origin = origin.xyz;\0D\0A            ray.Direction = direction.xyz;\0D\0A            ray.TMin = 0.001f;\0D\0A            ray.TMax = 10000.0f;\0D\0A        \0D\0A            RayPayload payload = (RayPayload) 0;\0D\0A            payload.Seed = randomSeed;\0D\0A\0D\0A            TraceRay(g_Scene, RAY_FLAG_FORCE_OPAQUE, 0xFF, 0, 0, 0, ray, payload);\0D\0A            \0D\0A            const float3 HIT_COLOR = payload.ColorAndDistance.rgb;\0D\0A            const float T = payload.ColorAndDistance.w;\0D\0A            const bool bIS_SCATTERED = (payload.ScatterDirection.w > 0.0f);\0D\0A   \0D\0A            rayColor *= HIT_COLOR;\0D\0A            \0D\0A            if (T < 0.0f || !bIS_SCATTERED)\0D\0A            {\0D\0A                break;\0D\0A            }\0D\0A            \0D\0A            origin = origin + T * direction;\0D\0A            direction = float4(payload.ScatterDirection.xyz, 0.0f);\0D\0A     \0D\0A        }\0D\0A        color += rayColor;\0D\0A    }\0D\0A    \0D\0A    color /= TotalNumberOfSamples;\0D\0A    color = sqrt(color);\0D\0A\0D\0A    // Write the raytraced color to the output texture.\0D\0A    g_RenderTarget[rayIndex.xy].rgb = color;\0D\0A    g_RenderTarget[rayIndex.xy].a = 1.0f;\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid MyClosestHitShader(inout RayPayload payload, in MyAttributes attr)\0D\0A{\0D\0A    float3 hitPosition = HitWorldPosition();\0D\0A    float3 worlRayDirection = WorldRayDirection();\0D\0A \0D\0A    uint indicesPerTriangle = 3;\0D\0A    uint baseIdx = indicesPerTriangle * PrimitiveIndex();\0D\0A    uint indexWithOffset = baseIdx + l_MeshBuffer.IndicesOffset;\0D\0A    \0D\0A    int i0 = g_Indices[indexWithOffset];\0D\0A    int i1 = g_Indices[indexWithOffset + 1];\0D\0A    int i2 = g_Indices[indexWithOffset + 2];\0D\0A\0D\0A    // Retrieve corresponding vertex normals for the triangle vertices.\0D\0A    float3x3 transform = (float3x3) ObjectToWorld3x4();\0D\0A    float3 vertexNormals[3] =\0D\0A    {\0D\0A        mul(transform, g_Vertices[i0 + l_MeshBuffer.VerticesOffset].Normal),\0D\0A        mul(transform, g_Vertices[i1 + l_MeshBuffer.VerticesOffset].Normal),\0D\0A        mul(transform, g_Vertices[i2 + l_MeshBuffer.VerticesOffset].Normal)\0D\0A    };\0D\0A\0D\0A    // Compute the triangle's normal.\0D\0A    // This is redundant and done for illustration purposes \0D\0A    // as all the per-vertex normals are the same and match triangle's normal in this sample. \0D\0A    float3 triangleNormal = HitAttribute(vertexNormals, attr);\0D\0A    float t = RayTCurrent();\0D\0A   \0D\0A    int materialId = l_MeshBuffer.MaterialID;\0D\0A    switch (materialId)\0D\0A    {\0D\0A        case 0: // Lambertian\0D\0A            payload = ScatterLambertian(l_MeshBuffer.Albedo, worlRayDirection, triangleNormal, t, payload.Seed);\0D\0A            break;\0D\0A        \0D\0A        case 1: // Metal\0D\0A            payload = ScatterMetal(l_MeshBuffer.Albedo, worlRayDirection, triangleNormal, t, payload.Seed);\0D\0A            break;\0D\0A        \0D\0A        case 2: // Dielectric\0D\0A            {\0D\0A                float refractionIndex = l_MeshBuffer.Albedo.x;\0D\0A                payload = ScatterDielectric(l_MeshBuffer.Albedo, worlRayDirection, triangleNormal, t, payload.Seed, refractionIndex);\0D\0A                break;\0D\0A            }\0D\0A    }\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid MyMissShader(inout RayPayload payload)\0D\0A{\0D\0A    float a = 0.5f * (normalize(WorldRayDirection().y + 1.0f));\0D\0A    payload.ColorAndDistance.rgb = (1.0f - a) * float3(1.0f, 1.0f, 1.0f) + a * float3(0.5f, 0.7f, 1.0f);\0D\0A    payload.ColorAndDistance.w = -1.0f;\0D\0A}\0D\0A\0D\0A#endif // RAYTRACING_HLSL"}
!186 = !{!".\5CHLSLCompat.h", !"#ifndef HLSLCOMPAT_H\0D\0A#define HLSLCOMPAT_H\0D\0A\0D\0Atypedef float3 XMFLOAT3;\0D\0Atypedef float4 XMFLOAT4;\0D\0Atypedef float4 XMVECTOR;\0D\0Atypedef float4x4 XMMATRIX;\0D\0Atypedef uint UINT;\0D\0A\0D\0A#endif\0D\0A"}
!187 = !{!".\5CRandom.hlsl", !"// CODE FROM: \0D\0A// https://github.com/GPSnoopy/RayTracingInVulkan\0D\0A// Generates a seed for a random number generator from 2 inputs plus a backoff\0D\0A// https://github.com/nvpro-samples/optix_prime_baking/blob/332a886f1ac46c0b3eea9e89a59593470c755a0e/random.h\0D\0A// https://github.com/nvpro-samples/vk_raytracing_tutorial_KHR/tree/master/ray_tracing_jitter_cam\0D\0A// https://en.wikipedia.org/wiki/Tiny_Encryption_Algorithm\0D\0Auint InitRandomSeed(in uint val0, in uint val1)\0D\0A{\0D\0A    uint v0 = val0, v1 = val1, s0 = 0;\0D\0A    \0D\0A    [unroll]\0D\0A    for (uint n = 0; n < 16; n++)\0D\0A    {\0D\0A        s0 += 0x9e3779b9;\0D\0A        v0 += ((v1 << 4) + 0xa341316c) ^ (v1 + s0) ^ ((v1 >> 5) + 0xc8013ea4);\0D\0A        v1 += ((v0 << 4) + 0xad90777d) ^ (v0 + s0) ^ ((v0 >> 5) + 0x7e95761e);\0D\0A    }\0D\0A\0D\0A    return v0;\0D\0A}\0D\0A\0D\0Auint RandomInt(inout uint seed)\0D\0A{\0D\0A\09// LCG values from Numerical Recipes\0D\0A    return (seed = 1664525 * seed + 1013904223);\0D\0A}\0D\0A\0D\0Afloat RandomFloat(inout uint seed)\0D\0A{\0D\0A\09//// Float version using bitmask from Numerical Recipes\0D\0A\09//const uint one = 0x3f800000;\0D\0A\09//const uint msk = 0x007fffff;\0D\0A\09//return uintBitsToFloat(one | (msk & (RandomInt(seed) >> 9))) - 1;\0D\0A\0D\0A\09// Faster version from NVIDIA examples; quality good enough for our use case.\0D\0A    return (float(RandomInt(seed) & 0x00FFFFFF) / float(0x01000000));\0D\0A}\0D\0A\0D\0Afloat3 SampleSquare(in uint seed)\0D\0A{\0D\0A    // Returns the vector to a random point in the [-.5,-.5]-[+.5,+.5] unit square.\0D\0A    return float3(RandomFloat(seed) - 0.5, RandomFloat(seed) - 0.5, 0);\0D\0A}\0D\0A\0D\0Afloat2 RandomInUnitDisk(inout uint seed)\0D\0A{\0D\0A    while (true)\0D\0A    {\0D\0A        const float2 p = 2 * float2(RandomFloat(seed), RandomFloat(seed)) - 1;\0D\0A        if (dot(p, p) < 1)\0D\0A        {\0D\0A            return p;\0D\0A        }\0D\0A    }\0D\0A}\0D\0A\0D\0Afloat3 RandomInUnitSphere(inout uint seed)\0D\0A{\0D\0A    while (true)\0D\0A    {\0D\0A        const float3 p = normalize(2 * float3(RandomFloat(seed), RandomFloat(seed), RandomFloat(seed)) - 1);\0D\0A        if (dot(p, p) < 1)\0D\0A        {\0D\0A            return p;\0D\0A        }\0D\0A    }\0D\0A}"}
!188 = !{!".\5CRaytracingHLSLCompat.h", !"#ifndef RAYTRACINGHLSLCOMPAT_H\0D\0A#define RAYTRACINGHLSLCOMPAT_H\0D\0A\0D\0A#ifdef HLSL\0D\0A#include \22HLSLCompat.h\22\0D\0A#else\0D\0Ausing namespace DirectX;\0D\0Atypedef UINT32 Index;\0D\0A#endif\0D\0A\0D\0Astruct FrameBuffer\0D\0A{\0D\0A\09XMMATRIX ProjectionToWorld;\0D\0A\09XMMATRIX ModelViewInverse;\0D\0A\09XMVECTOR CameraPosition;\0D\0A};\0D\0A\0D\0Astruct MeshBuffer\0D\0A{\0D\0A\09XMFLOAT4 Albedo;\0D\0A\09int MeshID;\0D\0A\09int MaterialID;\0D\0A\09int VerticesOffset;\0D\0A\09int IndicesOffset;\0D\0A};\0D\0A\0D\0Astruct Vertex\0D\0A{\0D\0A\09XMFLOAT3 Position;\0D\0A\09float pad1;\0D\0A\09XMFLOAT3 Normal;\0D\0A\09float pad2;\0D\0A};\0D\0A\0D\0A#endif\0D\0A"}
!189 = !{!"Raytracing.hlsl"}
!190 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_3", !"/Od", !"/Zi", !"-Qembed_debug"}
!191 = !{i32 1, i32 3}
!192 = !{i32 1, i32 7}
!193 = !{!"lib", i32 6, i32 3}
!194 = !{!195, !202, !205, null}
!195 = !{!196, !198, !200}
!196 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?g_Scene@@3URaytracingAccelerationStructure@@A", !"g_Scene", i32 0, i32 0, i32 1, i32 16, i32 0, !197}
!197 = !{i32 0, i32 4}
!198 = !{i32 1, %"class.StructuredBuffer<unsigned int>"* @"\01?g_Indices@@3V?$StructuredBuffer@I@@A", !"g_Indices", i32 0, i32 1, i32 1, i32 12, i32 0, !199}
!199 = !{i32 1, i32 4}
!200 = !{i32 2, %"class.StructuredBuffer<Vertex>"* @"\01?g_Vertices@@3V?$StructuredBuffer@UVertex@@@@A", !"g_Vertices", i32 0, i32 2, i32 1, i32 12, i32 0, !201}
!201 = !{i32 1, i32 32}
!202 = !{!203}
!203 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* @"\01?g_RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", !"g_RenderTarget", i32 0, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !204}
!204 = !{i32 0, i32 9}
!205 = !{!206, !207}
!206 = !{i32 0, %hostlayout.g_FrameBuffer* @g_FrameBuffer_legacy, !"g_FrameBuffer", i32 0, i32 0, i32 1, i32 144, null}
!207 = !{i32 1, %l_MeshBuffer* @l_MeshBuffer, !"l_MeshBuffer", i32 0, i32 1, i32 1, i32 32, null}
!208 = !{i32 0, %"class.StructuredBuffer<unsigned int>" undef, !209, %"class.StructuredBuffer<Vertex>" undef, !211, %struct.Vertex undef, !213, %struct.MeshBuffer undef, !218, %struct.BuiltInTriangleIntersectionAttributes undef, !224, %struct.RayPayload undef, !226, %l_MeshBuffer undef, !230, %hostlayout.struct.FrameBuffer undef, !232, %hostlayout.g_FrameBuffer undef, !237}
!209 = !{i32 4, !210}
!210 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 5}
!211 = !{i32 32, !212}
!212 = !{i32 6, !"h", i32 3, i32 0}
!213 = !{i32 32, !214, !215, !216, !217}
!214 = !{i32 6, !"Position", i32 3, i32 0, i32 7, i32 9}
!215 = !{i32 6, !"pad1", i32 3, i32 12, i32 7, i32 9}
!216 = !{i32 6, !"Normal", i32 3, i32 16, i32 7, i32 9}
!217 = !{i32 6, !"pad2", i32 3, i32 28, i32 7, i32 9}
!218 = !{i32 32, !219, !220, !221, !222, !223}
!219 = !{i32 6, !"Albedo", i32 3, i32 0, i32 7, i32 9}
!220 = !{i32 6, !"MeshID", i32 3, i32 16, i32 7, i32 4}
!221 = !{i32 6, !"MaterialID", i32 3, i32 20, i32 7, i32 4}
!222 = !{i32 6, !"VerticesOffset", i32 3, i32 24, i32 7, i32 4}
!223 = !{i32 6, !"IndicesOffset", i32 3, i32 28, i32 7, i32 4}
!224 = !{i32 8, !225}
!225 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!226 = !{i32 36, !227, !228, !229}
!227 = !{i32 6, !"ColorAndDistance", i32 3, i32 0, i32 7, i32 9}
!228 = !{i32 6, !"ScatterDirection", i32 3, i32 16, i32 7, i32 9}
!229 = !{i32 6, !"Seed", i32 3, i32 32, i32 7, i32 5}
!230 = !{i32 32, !231}
!231 = !{i32 6, !"l_MeshBuffer", i32 3, i32 0}
!232 = !{i32 144, !233, !235, !236}
!233 = !{i32 6, !"ProjectionToWorld", i32 2, !234, i32 3, i32 0, i32 7, i32 9}
!234 = !{i32 4, i32 4, i32 2}
!235 = !{i32 6, !"ModelViewInverse", i32 2, !234, i32 3, i32 64, i32 7, i32 9}
!236 = !{i32 6, !"CameraPosition", i32 3, i32 128, i32 7, i32 9}
!237 = !{i32 144, !238}
!238 = !{i32 6, !"g_FrameBuffer", i32 3, i32 0}
!239 = !{i32 1, void ()* @"\01?MyRaygenShader@@YAXXZ", !240, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !242, void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z", !245}
!240 = !{!241}
!241 = !{i32 1, !2, !2}
!242 = !{!241, !243, !244}
!243 = !{i32 2, !2, !2}
!244 = !{i32 0, !2, !2}
!245 = !{!241, !243}
!246 = !{null, !"", null, !194, !247}
!247 = !{i32 0, i64 73745}
!248 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !249}
!249 = !{i32 8, i32 10, i32 6, i32 36, i32 7, i32 8, i32 5, !250}
!250 = !{i32 0}
!251 = !{void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z", !"\01?MyMissShader@@YAXURayPayload@@@Z", null, null, !252}
!252 = !{i32 8, i32 11, i32 6, i32 36, i32 5, !250}
!253 = !{void ()* @"\01?MyRaygenShader@@YAXXZ", !"\01?MyRaygenShader@@YAXXZ", null, null, !254}
!254 = !{i32 8, i32 7, i32 5, !250}
!255 = !DILocation(line: 145, column: 13, scope: !256)
!256 = distinct !DILexicalBlock(scope: !257, file: !1, line: 129, column: 9)
!257 = distinct !DILexicalBlock(scope: !258, file: !1, line: 128, column: 9)
!258 = distinct !DILexicalBlock(scope: !259, file: !1, line: 128, column: 9)
!259 = distinct !DILexicalBlock(scope: !260, file: !1, line: 116, column: 5)
!260 = distinct !DILexicalBlock(scope: !261, file: !1, line: 115, column: 5)
!261 = distinct !DILexicalBlock(scope: !98, file: !1, line: 115, column: 5)
!262 = !DILocation(line: 169, column: 5, scope: !98)
!263 = !DILocation(line: 105, column: 10, scope: !98)
!264 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "TotalNumberOfSamples", scope: !98, file: !1, line: 105, type: !51)
!265 = !DIExpression()
!266 = !DILocation(line: 106, column: 76, scope: !98)
!267 = !DILocation(line: 106, column: 53, scope: !98)
!268 = !DILocation(line: 106, column: 38, scope: !98)
!269 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "val1", arg: 2, scope: !47, file: !48, line: 7, type: !51)
!270 = !DILocation(line: 7, column: 43, scope: !47, inlinedAt: !271)
!271 = distinct !DILocation(line: 106, column: 38, scope: !98)
!272 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "val0", arg: 1, scope: !47, file: !48, line: 7, type: !51)
!273 = !DILocation(line: 7, column: 29, scope: !47, inlinedAt: !271)
!274 = !DILocation(line: 9, column: 10, scope: !47, inlinedAt: !271)
!275 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v0", scope: !47, file: !48, line: 9, type: !51)
!276 = !DILocation(line: 9, column: 21, scope: !47, inlinedAt: !271)
!277 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v1", scope: !47, file: !48, line: 9, type: !51)
!278 = !DILocation(line: 9, column: 32, scope: !47, inlinedAt: !271)
!279 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s0", scope: !47, file: !48, line: 9, type: !51)
!280 = !DILocation(line: 12, column: 15, scope: !281, inlinedAt: !271)
!281 = distinct !DILexicalBlock(scope: !47, file: !48, line: 12, column: 5)
!282 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !281, file: !48, line: 12, type: !51)
!283 = !DILocation(line: 12, column: 5, scope: !281, inlinedAt: !271)
!284 = !DILocation(line: 14, column: 12, scope: !285, inlinedAt: !271)
!285 = distinct !DILexicalBlock(scope: !286, file: !48, line: 13, column: 5)
!286 = distinct !DILexicalBlock(scope: !281, file: !48, line: 12, column: 5)
!287 = !DILocation(line: 15, column: 20, scope: !285, inlinedAt: !271)
!288 = !DILocation(line: 15, column: 26, scope: !285, inlinedAt: !271)
!289 = !DILocation(line: 15, column: 46, scope: !285, inlinedAt: !271)
!290 = !DILocation(line: 15, column: 40, scope: !285, inlinedAt: !271)
!291 = !DILocation(line: 15, column: 59, scope: !285, inlinedAt: !271)
!292 = !DILocation(line: 15, column: 65, scope: !285, inlinedAt: !271)
!293 = !DILocation(line: 15, column: 52, scope: !285, inlinedAt: !271)
!294 = !DILocation(line: 15, column: 12, scope: !285, inlinedAt: !271)
!295 = !DILocation(line: 16, column: 20, scope: !285, inlinedAt: !271)
!296 = !DILocation(line: 16, column: 26, scope: !285, inlinedAt: !271)
!297 = !DILocation(line: 16, column: 46, scope: !285, inlinedAt: !271)
!298 = !DILocation(line: 16, column: 40, scope: !285, inlinedAt: !271)
!299 = !DILocation(line: 16, column: 59, scope: !285, inlinedAt: !271)
!300 = !DILocation(line: 16, column: 65, scope: !285, inlinedAt: !271)
!301 = !DILocation(line: 16, column: 52, scope: !285, inlinedAt: !271)
!302 = !DILocation(line: 16, column: 12, scope: !285, inlinedAt: !271)
!303 = !DILocation(line: 12, column: 31, scope: !286, inlinedAt: !271)
!304 = distinct !{!304, !305}
!305 = !{!"llvm.loop.unroll.full"}
!306 = !DILocation(line: 19, column: 5, scope: !47, inlinedAt: !271)
!307 = !DILocation(line: 106, column: 23, scope: !98)
!308 = !DILocation(line: 7, column: 43, scope: !47, inlinedAt: !309)
!309 = distinct !DILocation(line: 106, column: 23, scope: !98)
!310 = !DILocation(line: 7, column: 29, scope: !47, inlinedAt: !309)
!311 = !DILocation(line: 9, column: 10, scope: !47, inlinedAt: !309)
!312 = !DILocation(line: 9, column: 21, scope: !47, inlinedAt: !309)
!313 = !DILocation(line: 9, column: 32, scope: !47, inlinedAt: !309)
!314 = !DILocation(line: 12, column: 15, scope: !281, inlinedAt: !309)
!315 = !DILocation(line: 12, column: 5, scope: !281, inlinedAt: !309)
!316 = !DILocation(line: 14, column: 12, scope: !285, inlinedAt: !309)
!317 = !DILocation(line: 15, column: 12, scope: !285, inlinedAt: !309)
!318 = !DILocation(line: 16, column: 20, scope: !285, inlinedAt: !309)
!319 = !DILocation(line: 16, column: 26, scope: !285, inlinedAt: !309)
!320 = !DILocation(line: 16, column: 46, scope: !285, inlinedAt: !309)
!321 = !DILocation(line: 16, column: 40, scope: !285, inlinedAt: !309)
!322 = !DILocation(line: 16, column: 59, scope: !285, inlinedAt: !309)
!323 = !DILocation(line: 16, column: 65, scope: !285, inlinedAt: !309)
!324 = !DILocation(line: 16, column: 52, scope: !285, inlinedAt: !309)
!325 = !DILocation(line: 16, column: 12, scope: !285, inlinedAt: !309)
!326 = !DILocation(line: 12, column: 31, scope: !286, inlinedAt: !309)
!327 = !DILocation(line: 15, column: 20, scope: !285, inlinedAt: !309)
!328 = !DILocation(line: 15, column: 26, scope: !285, inlinedAt: !309)
!329 = !DILocation(line: 15, column: 46, scope: !285, inlinedAt: !309)
!330 = !DILocation(line: 15, column: 40, scope: !285, inlinedAt: !309)
!331 = !DILocation(line: 15, column: 59, scope: !285, inlinedAt: !309)
!332 = !DILocation(line: 15, column: 65, scope: !285, inlinedAt: !309)
!333 = !DILocation(line: 15, column: 52, scope: !285, inlinedAt: !309)
!334 = !DILocation(line: 19, column: 5, scope: !47, inlinedAt: !309)
!335 = !DILocation(line: 106, column: 10, scope: !98)
!336 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "seed", arg: 1, scope: !53, file: !48, line: 22, type: !51)
!337 = !DILocation(line: 22, column: 27, scope: !53, inlinedAt: !338)
!338 = distinct !DILocation(line: 36, column: 19, scope: !58, inlinedAt: !339)
!339 = distinct !DILocation(line: 49, column: 37, scope: !340, inlinedAt: !341)
!340 = distinct !DILexicalBlock(scope: !64, file: !48, line: 48, column: 5)
!341 = distinct !DILocation(line: 123, column: 43, scope: !259)
!342 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "seed", arg: 1, scope: !58, file: !48, line: 28, type: !51)
!343 = !DILocation(line: 28, column: 30, scope: !58, inlinedAt: !339)
!344 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "seed", arg: 1, scope: !64, file: !48, line: 45, type: !51)
!345 = !DILocation(line: 45, column: 36, scope: !64, inlinedAt: !341)
!346 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "randomSeed", scope: !98, file: !1, line: 106, type: !51)
!347 = !DILocation(line: 107, column: 10, scope: !98)
!348 = !DILocation(line: 22, column: 27, scope: !53, inlinedAt: !349)
!349 = distinct !DILocation(line: 36, column: 19, scope: !58, inlinedAt: !350)
!350 = distinct !DILocation(line: 119, column: 61, scope: !259)
!351 = !DILocation(line: 28, column: 30, scope: !58, inlinedAt: !350)
!352 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pixelRandomSeed", scope: !98, file: !1, line: 107, type: !51)
!353 = !DILocation(line: 109, column: 10, scope: !98)
!354 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bounces", scope: !98, file: !1, line: 109, type: !51)
!355 = !DILocation(line: 110, column: 11, scope: !98)
!356 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aperture", scope: !98, file: !1, line: 110, type: !4)
!357 = !DILocation(line: 111, column: 11, scope: !98)
!358 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "focusDistance", scope: !98, file: !1, line: 111, type: !4)
!359 = !DILocation(line: 112, column: 12, scope: !98)
!360 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "color", scope: !98, file: !1, line: 112, type: !5)
!361 = !DILocation(line: 113, column: 22, scope: !98)
!362 = !DILocation(line: 113, column: 11, scope: !98)
!363 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rayIndex", scope: !98, file: !1, line: 113, type: !364)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 113, baseType: !365)
!365 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 113, size: 96, align: 32, elements: !366, templateParams: !370)
!366 = !{!367, !368, !369}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !365, file: !1, line: 113, baseType: !52, size: 32, align: 32, flags: DIFlagPublic)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !365, file: !1, line: 113, baseType: !52, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !365, file: !1, line: 113, baseType: !52, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!370 = !{!154, !13}
!371 = !DIExpression(DW_OP_bit_piece, 0, 32)
!372 = !DIExpression(DW_OP_bit_piece, 32, 32)
!373 = !DILocation(line: 115, column: 14, scope: !261)
!374 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sample", scope: !261, file: !1, line: 115, type: !14)
!375 = !DILocation(line: 115, column: 5, scope: !261)
!376 = !DILocation(line: 28, column: 30, scope: !58, inlinedAt: !377)
!377 = distinct !DILocation(line: 119, column: 115, scope: !259)
!378 = !DILocation(line: 22, column: 27, scope: !53, inlinedAt: !379)
!379 = distinct !DILocation(line: 36, column: 19, scope: !58, inlinedAt: !377)
!380 = !DIExpression(DW_OP_bit_piece, 64, 32)
!381 = !DILocation(line: 117, column: 16, scope: !259)
!382 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rayColor", scope: !259, file: !1, line: 117, type: !5)
!383 = !DILocation(line: 119, column: 37, scope: !259)
!384 = !DILocation(line: 119, column: 61, scope: !259)
!385 = !DILocation(line: 36, column: 19, scope: !58, inlinedAt: !350)
!386 = !DILocation(line: 25, column: 28, scope: !53, inlinedAt: !349)
!387 = !DILocation(line: 25, column: 35, scope: !53, inlinedAt: !349)
!388 = !DILocation(line: 25, column: 18, scope: !53, inlinedAt: !349)
!389 = !DILocation(line: 25, column: 5, scope: !53, inlinedAt: !349)
!390 = !DILocation(line: 36, column: 35, scope: !58, inlinedAt: !350)
!391 = !DILocation(line: 36, column: 49, scope: !58, inlinedAt: !350)
!392 = !DILocation(line: 36, column: 5, scope: !58, inlinedAt: !350)
!393 = !DILocation(line: 119, column: 59, scope: !259)
!394 = !DILocation(line: 119, column: 91, scope: !259)
!395 = !DILocation(line: 119, column: 115, scope: !259)
!396 = !DILocation(line: 36, column: 19, scope: !58, inlinedAt: !377)
!397 = !DILocation(line: 25, column: 28, scope: !53, inlinedAt: !379)
!398 = !DILocation(line: 25, column: 35, scope: !53, inlinedAt: !379)
!399 = !DILocation(line: 25, column: 18, scope: !53, inlinedAt: !379)
!400 = !DILocation(line: 25, column: 5, scope: !53, inlinedAt: !379)
!401 = !DILocation(line: 36, column: 35, scope: !58, inlinedAt: !377)
!402 = !DILocation(line: 36, column: 49, scope: !58, inlinedAt: !377)
!403 = !DILocation(line: 36, column: 5, scope: !58, inlinedAt: !377)
!404 = !DILocation(line: 119, column: 113, scope: !259)
!405 = !DILocation(line: 119, column: 22, scope: !259)
!406 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "PIXEL", scope: !259, file: !1, line: 119, type: !407)
!407 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!408 = !DILocation(line: 120, column: 30, scope: !259)
!409 = !DILocation(line: 120, column: 28, scope: !259)
!410 = !DILocation(line: 120, column: 59, scope: !259)
!411 = !DILocation(line: 120, column: 66, scope: !259)
!412 = !DILocation(line: 120, column: 16, scope: !259)
!413 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uv", scope: !259, file: !1, line: 120, type: !15)
!414 = !DILocation(line: 121, column: 14, scope: !259)
!415 = !DILocation(line: 123, column: 43, scope: !259)
!416 = !DILocation(line: 47, column: 5, scope: !64, inlinedAt: !341)
!417 = !DILocation(line: 28, column: 30, scope: !58, inlinedAt: !418)
!418 = distinct !DILocation(line: 49, column: 56, scope: !340, inlinedAt: !341)
!419 = !DILocation(line: 22, column: 27, scope: !53, inlinedAt: !420)
!420 = distinct !DILocation(line: 36, column: 19, scope: !58, inlinedAt: !418)
!421 = !DILocation(line: 49, column: 37, scope: !340, inlinedAt: !341)
!422 = !DILocation(line: 36, column: 19, scope: !58, inlinedAt: !339)
!423 = !DILocation(line: 25, column: 28, scope: !53, inlinedAt: !338)
!424 = !DILocation(line: 25, column: 35, scope: !53, inlinedAt: !338)
!425 = !DILocation(line: 25, column: 18, scope: !53, inlinedAt: !338)
!426 = !DILocation(line: 25, column: 5, scope: !53, inlinedAt: !338)
!427 = !DILocation(line: 36, column: 35, scope: !58, inlinedAt: !339)
!428 = !DILocation(line: 36, column: 49, scope: !58, inlinedAt: !339)
!429 = !DILocation(line: 36, column: 5, scope: !58, inlinedAt: !339)
!430 = !DILocation(line: 49, column: 56, scope: !340, inlinedAt: !341)
!431 = !DILocation(line: 36, column: 19, scope: !58, inlinedAt: !418)
!432 = !DILocation(line: 25, column: 28, scope: !53, inlinedAt: !420)
!433 = !DILocation(line: 25, column: 35, scope: !53, inlinedAt: !420)
!434 = !DILocation(line: 25, column: 18, scope: !53, inlinedAt: !420)
!435 = !DILocation(line: 25, column: 5, scope: !53, inlinedAt: !420)
!436 = !DILocation(line: 36, column: 35, scope: !58, inlinedAt: !418)
!437 = !DILocation(line: 36, column: 49, scope: !58, inlinedAt: !418)
!438 = !DILocation(line: 36, column: 5, scope: !58, inlinedAt: !418)
!439 = !DILocation(line: 49, column: 28, scope: !340, inlinedAt: !341)
!440 = !DILocation(line: 49, column: 75, scope: !340, inlinedAt: !341)
!441 = !DILocation(line: 49, column: 22, scope: !340, inlinedAt: !341)
!442 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !340, file: !48, line: 49, type: !407)
!443 = !DILocation(line: 50, column: 13, scope: !444, inlinedAt: !341)
!444 = distinct !DILexicalBlock(scope: !340, file: !48, line: 50, column: 13)
!445 = !DILocation(line: 50, column: 23, scope: !444, inlinedAt: !341)
!446 = !DILocation(line: 50, column: 13, scope: !340, inlinedAt: !341)
!447 = !DILocation(line: 52, column: 13, scope: !448, inlinedAt: !341)
!448 = distinct !DILexicalBlock(scope: !444, file: !48, line: 51, column: 9)
!449 = !DILocation(line: 123, column: 41, scope: !259)
!450 = !DILocation(line: 123, column: 16, scope: !259)
!451 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset", scope: !259, file: !1, line: 123, type: !15)
!452 = !DILocation(line: 124, column: 71, scope: !259)
!453 = !DILocation(line: 124, column: 25, scope: !259)
!454 = !DILocation(line: 124, column: 16, scope: !259)
!455 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "origin", scope: !259, file: !1, line: 124, type: !22)
!456 = !DILocation(line: 125, column: 77, scope: !259)
!457 = !DILocation(line: 125, column: 25, scope: !259)
!458 = !DILocation(line: 125, column: 16, scope: !259)
!459 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "target", scope: !259, file: !1, line: 125, type: !22)
!460 = !DILocation(line: 126, column: 122, scope: !259)
!461 = !DILocation(line: 126, column: 60, scope: !259)
!462 = !DILocation(line: 126, column: 76, scope: !259)
!463 = !DILocation(line: 126, column: 39, scope: !259)
!464 = !DILocation(line: 126, column: 28, scope: !259)
!465 = !DILocation(line: 126, column: 16, scope: !259)
!466 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "direction", scope: !259, file: !1, line: 126, type: !22)
!467 = !DILocation(line: 128, column: 18, scope: !258)
!468 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !258, file: !1, line: 128, type: !14)
!469 = !DILocation(line: 128, column: 9, scope: !258)
!470 = !DILocation(line: 130, column: 19, scope: !471)
!471 = distinct !DILexicalBlock(scope: !256, file: !1, line: 130, column: 17)
!472 = !DILocation(line: 130, column: 17, scope: !256)
!473 = !DILocation(line: 132, column: 26, scope: !474)
!474 = distinct !DILexicalBlock(scope: !471, file: !1, line: 131, column: 13)
!475 = !DILocation(line: 133, column: 17, scope: !474)
!476 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ray", scope: !256, file: !1, line: 136, type: !477)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 136, size: 256, align: 32, elements: !478)
!478 = !{!479, !480, !481, !482}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !477, file: !1, line: 136, baseType: !6, size: 96, align: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !477, file: !1, line: 136, baseType: !4, size: 32, align: 32, offset: 96)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !477, file: !1, line: 136, baseType: !6, size: 96, align: 32, offset: 128)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !477, file: !1, line: 136, baseType: !4, size: 32, align: 32, offset: 224)
!483 = !DILocation(line: 136, column: 21, scope: !256)
!484 = !DILocation(line: 137, column: 26, scope: !256)
!485 = !DILocation(line: 137, column: 17, scope: !256)
!486 = !DILocation(line: 137, column: 24, scope: !256)
!487 = !DILocation(line: 138, column: 29, scope: !256)
!488 = !DILocation(line: 138, column: 17, scope: !256)
!489 = !DILocation(line: 138, column: 27, scope: !256)
!490 = !DILocation(line: 139, column: 17, scope: !256)
!491 = !DILocation(line: 139, column: 22, scope: !256)
!492 = !DILocation(line: 140, column: 17, scope: !256)
!493 = !DILocation(line: 140, column: 22, scope: !256)
!494 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "payload", scope: !256, file: !1, line: 142, type: !89)
!495 = !DILocation(line: 142, column: 24, scope: !256)
!496 = !DILocation(line: 142, column: 47, scope: !256)
!497 = !DILocation(line: 143, column: 21, scope: !256)
!498 = !DILocation(line: 143, column: 26, scope: !256)
!499 = !DILocation(line: 147, column: 46, scope: !256)
!500 = !DILocation(line: 147, column: 38, scope: !256)
!501 = !DILocation(line: 147, column: 26, scope: !256)
!502 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "HIT_COLOR", scope: !256, file: !1, line: 147, type: !503)
!503 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!504 = !DILocation(line: 148, column: 37, scope: !256)
!505 = !DILocation(line: 148, column: 29, scope: !256)
!506 = !DILocation(line: 148, column: 25, scope: !256)
!507 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "T", scope: !256, file: !1, line: 148, type: !73)
!508 = !DILocation(line: 149, column: 49, scope: !256)
!509 = !DILocation(line: 149, column: 41, scope: !256)
!510 = !DILocation(line: 149, column: 68, scope: !256)
!511 = !DILocation(line: 149, column: 24, scope: !256)
!512 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bIS_SCATTERED", scope: !256, file: !1, line: 149, type: !513)
!513 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !514)
!514 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!515 = !DILocation(line: 151, column: 22, scope: !256)
!516 = !DILocation(line: 153, column: 19, scope: !517)
!517 = distinct !DILexicalBlock(scope: !256, file: !1, line: 153, column: 17)
!518 = !DILocation(line: 153, column: 26, scope: !517)
!519 = !DILocation(line: 153, column: 30, scope: !517)
!520 = !DILocation(line: 153, column: 17, scope: !256)
!521 = !DILocation(line: 155, column: 17, scope: !522)
!522 = distinct !DILexicalBlock(scope: !517, file: !1, line: 154, column: 13)
!523 = !DILocation(line: 158, column: 31, scope: !256)
!524 = !DILocation(line: 158, column: 33, scope: !256)
!525 = !DILocation(line: 158, column: 29, scope: !256)
!526 = !DILocation(line: 158, column: 20, scope: !256)
!527 = !DILocation(line: 159, column: 40, scope: !256)
!528 = !DILocation(line: 159, column: 32, scope: !256)
!529 = !DILocation(line: 159, column: 23, scope: !256)
!530 = !DIExpression(DW_OP_bit_piece, 96, 32)
!531 = !DILocation(line: 161, column: 9, scope: !256)
!532 = !DILocation(line: 128, column: 39, scope: !257)
!533 = !DILocation(line: 128, column: 27, scope: !257)
!534 = !DILocation(line: 162, column: 15, scope: !259)
!535 = !DILocation(line: 163, column: 5, scope: !259)
!536 = !DILocation(line: 115, column: 57, scope: !260)
!537 = !DILocation(line: 115, column: 33, scope: !260)
!538 = !DILocation(line: 165, column: 11, scope: !98)
!539 = !DILocation(line: 166, column: 13, scope: !98)
!540 = !DILocation(line: 166, column: 11, scope: !98)
!541 = !DILocation(line: 169, column: 37, scope: !98)
!542 = !DILocation(line: 170, column: 5, scope: !98)
!543 = !DILocation(line: 170, column: 35, scope: !98)
!544 = !DILocation(line: 171, column: 1, scope: !98)
!545 = !DILocation(line: 191, column: 24, scope: !101)
!546 = !DILocation(line: 183, column: 14, scope: !101)
!547 = !DILocation(line: 174, column: 42, scope: !101)
