#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;       Typed UAV Load Additional Formats
;
; shader debug name: 62ae77edf3fccd538d8201c6b5e9d418.pdb
; shader hash: 62ae77edf3fccd538d8201c6b5e9d418
;
; Buffer Definitions:
;
; cbuffer frameBuffer
; {
;
;   struct hostlayout.frameBuffer
;   {
;
;       struct hostlayout.struct.FrameBuffer
;       {
;
;           row_major float4x4 ProjectionToWorld;     ; Offset:    0
;           row_major float4x4 ModelViewInverse;      ; Offset:   64
;           float4 CameraPosition;                    ; Offset:  128
;       
;       } frameBuffer;                                ; Offset:    0
;
;   
;   } frameBuffer;                                    ; Offset:    0 Size:   144
;
; }
;
; cbuffer meshBuffer
; {
;
;   struct meshBuffer
;   {
;
;       struct struct.MeshBuffer
;       {
;
;           float4 Albedo;                            ; Offset:    0
;           int MeshID;                               ; Offset:   16
;           int MaterialID;                           ; Offset:   20
;           int VerticesOffset;                       ; Offset:   24
;           int IndicesOffset;                        ; Offset:   28
;       
;       } meshBuffer;                                 ; Offset:    0
;
;   
;   } meshBuffer;                                     ; Offset:    0 Size:    32
;
; }
;
; Resource bind info for Indices
; {
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.7.2308.16 (52da17e29)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31, globals: !94)
!1 = !DIFile(filename: "Raytracing.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !5, !15, !22}
!4 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 37, baseType: !6)
!6 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 37, size: 96, align: 32, elements: !7, templateParams: !11)
!7 = !{!8, !9, !10}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !6, file: !1, line: 37, baseType: !4, size: 32, align: 32, flags: DIFlagPublic)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !6, file: !1, line: 37, baseType: !4, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !6, file: !1, line: 37, baseType: !4, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !4)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 43, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 43, size: 64, align: 32, elements: !17, templateParams: !20)
!17 = !{!18, !19}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, line: 43, baseType: !4, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, line: 43, baseType: !4, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !{!12, !21}
!21 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 54, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 54, size: 128, align: 32, elements: !24, templateParams: !29)
!24 = !{!25, !26, !27, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 54, baseType: !4, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 54, baseType: !4, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, line: 54, baseType: !4, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !23, file: !1, line: 54, baseType: !4, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!29 = !{!12, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 4)
!31 = !{!32, !38, !43, !46, !49, !52, !55, !59, !62, !71, !79, !80, !83, !86, !91}
!32 = !DISubprogram(name: "InitRandomSeed", linkageName: "\01?InitRandomSeed@@YAIII@Z", scope: !33, file: !33, line: 7, type: !34, isLocal: false, isDefinition: true, scopeLine: 8, flags: DIFlagPrototyped, isOptimized: false)
!33 = !DIFile(filename: "./Random.hlsl", directory: "")
!34 = !DISubroutineType(types: !35)
!35 = !{!36, !36, !36}
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !37)
!37 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!38 = !DISubprogram(name: "RandomInt", linkageName: "\01?RandomInt@@YAIAIAI@Z", scope: !33, file: !33, line: 22, type: !39, isLocal: false, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: false)
!39 = !DISubroutineType(types: !40)
!40 = !{!36, !41}
!41 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !36)
!43 = !DISubprogram(name: "RandomFloat", linkageName: "\01?RandomFloat@@YAMAIAI@Z", scope: !33, file: !33, line: 28, type: !44, isLocal: false, isDefinition: true, scopeLine: 29, flags: DIFlagPrototyped, isOptimized: false)
!44 = !DISubroutineType(types: !45)
!45 = !{!4, !41}
!46 = !DISubprogram(name: "SampleSquare", linkageName: "\01?SampleSquare@@YA?AV?$vector@M$02@@I@Z", scope: !33, file: !33, line: 39, type: !47, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: false)
!47 = !DISubroutineType(types: !48)
!48 = !{!5, !36}
!49 = !DISubprogram(name: "RandomInUnitDisk", linkageName: "\01?RandomInUnitDisk@@YA?AV?$vector@M$01@@AIAI@Z", scope: !33, file: !33, line: 45, type: !50, isLocal: false, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: false)
!50 = !DISubroutineType(types: !51)
!51 = !{!15, !41}
!52 = !DISubprogram(name: "RandomInUnitSphere", linkageName: "\01?RandomInUnitSphere@@YA?AV?$vector@M$02@@AIAI@Z", scope: !33, file: !33, line: 57, type: !53, isLocal: false, isDefinition: true, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: false)
!53 = !DISubroutineType(types: !54)
!54 = !{!5, !41}
!55 = !DISubprogram(name: "Schlick", linkageName: "\01?Schlick@@YAMMM@Z", scope: !1, file: !1, line: 19, type: !56, isLocal: false, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: false)
!56 = !DISubroutineType(types: !57)
!57 = !{!4, !58, !58}
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!59 = !DISubprogram(name: "HitWorldPosition", linkageName: "\01?HitWorldPosition@@YA?AV?$vector@M$02@@XZ", scope: !1, file: !1, line: 43, type: !60, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: false)
!60 = !DISubroutineType(types: !61)
!61 = !{!5}
!62 = !DISubprogram(name: "HitAttribute", linkageName: "\01?HitAttribute@@YA?AV?$vector@M$02@@Y02V1@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 49, type: !63, isLocal: false, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false)
!63 = !DISubroutineType(types: !64)
!64 = !{!5, !65, !68}
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 288, align: 32, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 3)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 46, size: 64, align: 32, elements: !69)
!69 = !{!70}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !68, file: !1, line: 46, baseType: !16, size: 64, align: 32)
!71 = !DISubprogram(name: "ScatterLambertian", linkageName: "\01?ScatterLambertian@@YA?AURayPayload@@V?$vector@M$03@@V?$vector@M$02@@1MI@Z", scope: !1, file: !1, line: 56, type: !72, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: false)
!72 = !DISubroutineType(types: !73)
!73 = !{!74, !22, !5, !5, !4, !36}
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayPayload", file: !1, line: 35, size: 288, align: 32, elements: !75)
!75 = !{!76, !77, !78}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "colorAndDistance", scope: !74, file: !1, line: 37, baseType: !22, size: 128, align: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "scatterDirection", scope: !74, file: !1, line: 38, baseType: !22, size: 128, align: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "seed", scope: !74, file: !1, line: 39, baseType: !36, size: 32, align: 32, offset: 256)
!79 = !DISubprogram(name: "ScatterMetal", linkageName: "\01?ScatterMetal@@YA?AURayPayload@@V?$vector@M$03@@V?$vector@M$02@@1MI@Z", scope: !1, file: !1, line: 69, type: !72, isLocal: false, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: false)
!80 = !DISubprogram(name: "ScatterDielectric", linkageName: "\01?ScatterDielectric@@YA?AURayPayload@@V?$vector@M$03@@V?$vector@M$02@@1MIM@Z", scope: !1, file: !1, line: 84, type: !81, isLocal: false, isDefinition: true, scopeLine: 85, flags: DIFlagPrototyped, isOptimized: false)
!81 = !DISubroutineType(types: !82)
!82 = !{!74, !22, !5, !5, !4, !36, !4}
!83 = !DISubprogram(name: "MyRaygenShader", linkageName: "\01?MyRaygenShader@@YAXXZ", scope: !1, file: !1, line: 107, type: !84, isLocal: false, isDefinition: true, scopeLine: 108, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?MyRaygenShader@@YAXXZ")
!84 = !DISubroutineType(types: !85)
!85 = !{null}
!86 = !DISubprogram(name: "MyClosestHitShader", linkageName: "\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 177, type: !87, isLocal: false, isDefinition: true, scopeLine: 178, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!87 = !DISubroutineType(types: !88)
!88 = !{null, !89, !90}
!89 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !74)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "MyAttributes", file: !1, line: 34, baseType: !68)
!91 = !DISubprogram(name: "MyMissShader", linkageName: "\01?MyMissShader@@YAXURayPayload@@@Z", scope: !1, file: !1, line: 221, type: !92, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z")
!92 = !DISubroutineType(types: !93)
!93 = !{null, !89}
!94 = !{!95, !97, !99, !101, !105, !109, !122, !155}
!95 = !DIGlobalVariable(name: "color", scope: !80, file: !1, line: 95, type: !96, isLocal: true, isDefinition: true)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!97 = !DIGlobalVariable(name: "RAY_FLAG_FORCE_OPAQUE", scope: !0, file: !1, line: 148, type: !98, isLocal: true, isDefinition: true, variable: i32 1)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!99 = !DIGlobalVariable(name: "Scene", linkageName: "\01?Scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 26, type: !100, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?Scene@@3URaytracingAccelerationStructure@@A")
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 26, size: 32, align: 32, elements: !2)
!101 = !DIGlobalVariable(name: "RenderTarget", linkageName: "\01?RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 27, type: !102, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!102 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 27, size: 128, align: 32, elements: !2, templateParams: !103)
!103 = !{!104}
!104 = !DITemplateTypeParameter(name: "element", type: !23)
!105 = !DIGlobalVariable(name: "Indices", linkageName: "\01?Indices@@3V?$StructuredBuffer@H@@A", scope: !0, file: !1, line: 28, type: !106, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<int>"* @"\01?Indices@@3V?$StructuredBuffer@H@@A")
!106 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<int>", file: !1, line: 28, size: 32, align: 32, elements: !2, templateParams: !107)
!107 = !{!108}
!108 = !DITemplateTypeParameter(name: "element", type: !14)
!109 = !DIGlobalVariable(name: "Vertices", linkageName: "\01?Vertices@@3V?$StructuredBuffer@UVertex@@@@A", scope: !0, file: !1, line: 29, type: !110, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<Vertex>"* @"\01?Vertices@@3V?$StructuredBuffer@UVertex@@@@A")
!110 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<Vertex>", file: !1, line: 29, size: 256, align: 32, elements: !2, templateParams: !111)
!111 = !{!112}
!112 = !DITemplateTypeParameter(name: "element", type: !113)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vertex", file: !114, line: 40, size: 256, align: 32, elements: !115)
!114 = !DIFile(filename: "./RaytracingHlslCompat.h", directory: "")
!115 = !{!116, !119, !120, !121}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !113, file: !114, line: 42, baseType: !117, size: 96, align: 32)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT3", file: !118, line: 15, baseType: !5)
!118 = !DIFile(filename: "./HlslCompat.h", directory: "")
!119 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !113, file: !114, line: 43, baseType: !4, size: 32, align: 32, offset: 96)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "Normal", scope: !113, file: !114, line: 44, baseType: !117, size: 96, align: 32, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !113, file: !114, line: 45, baseType: !4, size: 32, align: 32, offset: 224)
!122 = !DIGlobalVariable(name: "frameBuffer", linkageName: "\01?frameBuffer@@3U?$ConstantBuffer@UFrameBuffer@@@@A", scope: !0, file: !1, line: 31, type: !123, isLocal: false, isDefinition: true)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<FrameBuffer>", file: !1, line: 31, size: 32, align: 32, elements: !2, templateParams: !124)
!124 = !{!125}
!125 = !DITemplateTypeParameter(name: "T", type: !126)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "FrameBuffer", file: !114, line: 24, size: 1152, align: 32, elements: !127)
!127 = !{!128, !152, !153}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "ProjectionToWorld", scope: !126, file: !114, line: 26, baseType: !129, size: 512, align: 32)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMMATRIX", file: !118, line: 18, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 31, baseType: !131)
!131 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 31, size: 512, align: 32, elements: !132, templateParams: !149)
!132 = !{!133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !131, file: !1, line: 31, baseType: !4, size: 32, align: 32, flags: DIFlagPublic)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !131, file: !1, line: 31, baseType: !4, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !131, file: !1, line: 31, baseType: !4, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !131, file: !1, line: 31, baseType: !4, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !131, file: !1, line: 31, baseType: !4, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !131, file: !1, line: 31, baseType: !4, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !131, file: !1, line: 31, baseType: !4, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !131, file: !1, line: 31, baseType: !4, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !131, file: !1, line: 31, baseType: !4, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !131, file: !1, line: 31, baseType: !4, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !131, file: !1, line: 31, baseType: !4, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !131, file: !1, line: 31, baseType: !4, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !131, file: !1, line: 31, baseType: !4, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !131, file: !1, line: 31, baseType: !4, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !131, file: !1, line: 31, baseType: !4, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !131, file: !1, line: 31, baseType: !4, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!149 = !{!12, !150, !151}
!150 = !DITemplateValueParameter(name: "row_count", type: !14, value: i32 4)
!151 = !DITemplateValueParameter(name: "col_count", type: !14, value: i32 4)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "ModelViewInverse", scope: !126, file: !114, line: 27, baseType: !129, size: 512, align: 32, offset: 512)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "CameraPosition", scope: !126, file: !114, line: 28, baseType: !154, size: 128, align: 32, offset: 1024)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMVECTOR", file: !118, line: 17, baseType: !22)
!155 = !DIGlobalVariable(name: "meshBuffer", linkageName: "\01?meshBuffer@@3U?$ConstantBuffer@UMeshBuffer@@@@A", scope: !0, file: !1, line: 32, type: !156, isLocal: false, isDefinition: true)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<MeshBuffer>", file: !1, line: 32, size: 32, align: 32, elements: !2, templateParams: !157)
!157 = !{!158}
!158 = !DITemplateTypeParameter(name: "T", type: !159)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshBuffer", file: !114, line: 31, size: 256, align: 32, elements: !160)
!160 = !{!161, !163, !164, !165, !166}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "Albedo", scope: !159, file: !114, line: 33, baseType: !162, size: 128, align: 32)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMFLOAT4", file: !118, line: 16, baseType: !22)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "MeshID", scope: !159, file: !114, line: 34, baseType: !14, size: 32, align: 32, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "MaterialID", scope: !159, file: !114, line: 35, baseType: !14, size: 32, align: 32, offset: 160)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "VerticesOffset", scope: !159, file: !114, line: 36, baseType: !14, size: 32, align: 32, offset: 192)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "IndicesOffset", scope: !159, file: !114, line: 37, baseType: !14, size: 32, align: 32, offset: 224)
!167 = !{i32 2, !"Dwarf Version", i32 4}
!168 = !{i32 2, !"Debug Info Version", i32 3}
!169 = !{!"dxcoob 1.7.2308.16 (52da17e29)"}
!170 = !{!"Raytracing.hlsl", !"//*********************************************************\0D\0A//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A//*********************************************************\0D\0A\0D\0A#ifndef RAYTRACING_HLSL\0D\0A#define RAYTRACING_HLSL\0D\0A\0D\0A#define HLSL\0D\0A#include \22RaytracingHlslCompat.h\22\0D\0A#include \22Random.hlsl\22\0D\0A\0D\0Afloat Schlick(const float cosine, const float refractionIndex)\0D\0A{\0D\0A    float r0 = (1 - refractionIndex) / (1 + refractionIndex);\0D\0A    r0 *= r0;\0D\0A    return r0 + (1 - r0) * pow(1 - cosine, 5);\0D\0A}\0D\0A\0D\0ARaytracingAccelerationStructure Scene : register(t0, space0);\0D\0ARWTexture2D<float4> RenderTarget : register(u0);\0D\0AStructuredBuffer<int> Indices : register(t1, space0);\0D\0AStructuredBuffer<Vertex> Vertices : register(t2, space0);\0D\0A\0D\0AConstantBuffer<FrameBuffer> frameBuffer : register(b0);\0D\0AConstantBuffer<MeshBuffer> meshBuffer : register(b1);\0D\0A\0D\0Atypedef BuiltInTriangleIntersectionAttributes MyAttributes;\0D\0Astruct RayPayload\0D\0A{\0D\0A    float4 colorAndDistance;\0D\0A    float4 scatterDirection;\0D\0A    uint seed;\0D\0A};\0D\0A\0D\0A// Retrieve hit world position.\0D\0Afloat3 HitWorldPosition()\0D\0A{\0D\0A    return WorldRayOrigin() + RayTCurrent() * WorldRayDirection();\0D\0A}\0D\0A\0D\0A// Retrieve attribute at a hit position interpolated from vertex attributes using the hit's barycentrics.\0D\0Afloat3 HitAttribute(float3 vertexAttribute[3], BuiltInTriangleIntersectionAttributes attr)\0D\0A{\0D\0A    return vertexAttribute[0] +\0D\0A        attr.barycentrics.x * (vertexAttribute[1] - vertexAttribute[0]) +\0D\0A        attr.barycentrics.y * (vertexAttribute[2] - vertexAttribute[0]);\0D\0A}\0D\0A\0D\0ARayPayload ScatterLambertian(in float4 albedo, in float3 worldRayDirection, in float3 normal, in float t, in uint seed)\0D\0A{\0D\0A    bool isScattered = dot(worldRayDirection, normal) < 0;\0D\0A    float4 colorAndDistance = float4(albedo.rgb, t);\0D\0A    float4 scatter = float4(normal + RandomInUnitSphere(seed), isScattered ? 1 : 0);\0D\0A\0D\0A    RayPayload payload = (RayPayload) 0;\0D\0A    payload.colorAndDistance = colorAndDistance;\0D\0A    payload.scatterDirection = scatter;\0D\0A    payload.seed = seed;\0D\0A    return payload;\0D\0A}\0D\0A\0D\0ARayPayload ScatterMetal(in float4 albedo, in float3 worldRayDirection, in float3 normal, in float t, in uint seed)\0D\0A{\0D\0A    const float3 reflected = reflect(worldRayDirection, normal);\0D\0A    const bool isScattered = dot(reflected, normal) > 0;\0D\0A    \0D\0A    const float4 colorAndDistance = float4(albedo.rgb, t);\0D\0A    const float4 scatter = float4(reflected + albedo.w * RandomInUnitSphere(seed), isScattered ? 1 : 0);\0D\0A    \0D\0A    RayPayload payload = (RayPayload) 0;\0D\0A    payload.colorAndDistance = colorAndDistance;\0D\0A    payload.scatterDirection = scatter;\0D\0A    payload.seed = seed;\0D\0A    return payload;\0D\0A}\0D\0A\0D\0ARayPayload ScatterDielectric(in float4 albedo, in float3 worldRayDirection, in float3 normal, in float t, in uint seed, float refractionIndex)\0D\0A{\0D\0A    //\0D\0A    const float DoN = dot(worldRayDirection, normal);\0D\0A    const float3 outwardNormal = DoN > 0 ? -normal : normal;\0D\0A    const float niOverNt = DoN > 0 ? refractionIndex : 1 / refractionIndex;\0D\0A    const float cosine = DoN > 0 ? refractionIndex * DoN : -DoN;\0D\0A\0D\0A    const float3 refracted = refract(worldRayDirection, outwardNormal, niOverNt);\0D\0A    const float reflectProb = select(refracted != float3(0, 0, 0), Schlick(cosine, refractionIndex), 1);\0D\0A\0D\0A    const float4 color = float4(1.0, 1.0, 1.0, 1.0);\0D\0A\09\0D\0A    RayPayload payload = (RayPayload) 0;\0D\0A    payload.colorAndDistance = float4(color.rgb, t);\0D\0A    payload.scatterDirection = RandomFloat(seed) < reflectProb ? float4(reflect(worldRayDirection, normal), 1) : float4(refracted, 1);\0D\0A    payload.seed = seed;\0D\0A    return payload;\0D\0A}\0D\0A\0D\0A// Inspired with:\0D\0A// https://github.com/GPSnoopy/RayTracingInVulkan\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid MyRaygenShader()\0D\0A{\0D\0A    uint TotalNumberOfSamples = 4; // TODO: should be in camera\0D\0A    uint randomSeed = InitRandomSeed(InitRandomSeed(DispatchRaysIndex().x, DispatchRaysIndex().y), TotalNumberOfSamples);\0D\0A    uint pixelRandomSeed = 1; // TODO: pass with raypayload\0D\0A    // Generate a ray for a camera pixel corresponding to an index from the dispatched 2D grid.\0D\0A    uint bounces = 8;\0D\0A    float aperture = 0.1;\0D\0A    float focusDistance = 10.4;\0D\0A    float3 color = float3(0.0, 0.0, 0.0);\0D\0A    \0D\0A    for (int sample = 0; sample < TotalNumberOfSamples; sample++)\0D\0A    {\0D\0A        float3 rayColor = float3(1.0, 1.0, 1.0);\0D\0A       \0D\0A        const float2 pixel = float2(DispatchRaysIndex().x + RandomFloat(pixelRandomSeed), DispatchRaysIndex().y + RandomFloat(pixelRandomSeed));\0D\0A        float2 uv = (pixel / DispatchRaysDimensions().xy) * 2.0 - 1.0;\0D\0A        uv.y *= -1; // directx \0D\0A \0D\0A        float2 offset = aperture / 2 * RandomInUnitDisk(randomSeed);\0D\0A        float4 origin = mul(float4(offset, 0, 1), frameBuffer.ModelViewInverse);\0D\0A        float4 target = mul((float4(uv.x, uv.y, 1, 1)), frameBuffer.ProjectionToWorld);\0D\0A        float4 direction = mul(float4(normalize(target.xyz * focusDistance - float3(offset, 0)), 0), frameBuffer.ModelViewInverse);\0D\0A       \0D\0A        for (int i = 0; i <= bounces; ++i)\0D\0A        {\0D\0A            if (i == bounces)\0D\0A            {\0D\0A                rayColor = float3(0.0, 0.0, 0.0);\0D\0A                break;\0D\0A            }\0D\0A            \0D\0A            RayDesc ray;\0D\0A            ray.Origin = origin.xyz;\0D\0A            ray.Direction = direction.xyz;\0D\0A            ray.TMin = 0.001;\0D\0A            ray.TMax = 10000.0;\0D\0A        \0D\0A            RayPayload payload = (RayPayload) 0;\0D\0A            payload.seed = randomSeed;\0D\0A\0D\0A            TraceRay(Scene, RAY_FLAG_FORCE_OPAQUE, 0xFF, 0, 0, 0, ray, payload);\0D\0A            \0D\0A            const float3 hitColor = payload.colorAndDistance.rgb;\0D\0A            const float t = payload.colorAndDistance.w;\0D\0A            const bool isScattered = payload.scatterDirection.w > 0;\0D\0A   \0D\0A            rayColor *= hitColor;\0D\0A            \0D\0A            if (t < 0 || !isScattered)\0D\0A            {\0D\0A                break;\0D\0A            }\0D\0A            \0D\0A            origin = origin + t * direction;\0D\0A            direction = float4(payload.scatterDirection.xyz, 0);\0D\0A     \0D\0A        }\0D\0A        color += rayColor;\0D\0A    }\0D\0A    \0D\0A    color /= TotalNumberOfSamples;\0D\0A    color = sqrt(color);\0D\0A\0D\0A    // Write the raytraced color to the output texture.\0D\0A    RenderTarget[DispatchRaysIndex().xy].rgb = color;\0D\0A    RenderTarget[DispatchRaysIndex().xy].a = 1.0f;\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid MyClosestHitShader(inout RayPayload payload, in MyAttributes attr)\0D\0A{\0D\0A    float3 hitPosition = HitWorldPosition();\0D\0A    float3 worlRayDirection = WorldRayDirection();\0D\0A \0D\0A    uint indicesPerTriangle = 3;\0D\0A    uint baseIdx = indicesPerTriangle * PrimitiveIndex();\0D\0A    uint indexWithOffset = baseIdx + meshBuffer.IndicesOffset;\0D\0A    \0D\0A    int i0 = Indices[indexWithOffset + 0];\0D\0A    int i1 = Indices[indexWithOffset + 1];\0D\0A    int i2 = Indices[indexWithOffset + 2];\0D\0A\0D\0A    // Retrieve corresponding vertex normals for the triangle vertices.\0D\0A    float3 vertexNormals[3] =\0D\0A    {\0D\0A        Vertices[i0 + meshBuffer.VerticesOffset].Normal,\0D\0A        Vertices[i1 + meshBuffer.VerticesOffset].Normal,\0D\0A        Vertices[i2 + meshBuffer.VerticesOffset].Normal \0D\0A    };\0D\0A\0D\0A    // Compute the triangle's normal.\0D\0A    // This is redundant and done for illustration purposes \0D\0A    // as all the per-vertex normals are the same and match triangle's normal in this sample. \0D\0A    float3 triangleNormal = HitAttribute(vertexNormals, attr);\0D\0A    float t = RayTCurrent();\0D\0A   \0D\0A    int materialId = meshBuffer.MaterialID;\0D\0A    switch (materialId)\0D\0A    {\0D\0A        case 0:\0D\0A            payload = ScatterLambertian(meshBuffer.Albedo, worlRayDirection, triangleNormal, t, payload.seed);\0D\0A            break;\0D\0A        case 1:\0D\0A            payload = ScatterMetal(meshBuffer.Albedo, worlRayDirection, triangleNormal, t, payload.seed);\0D\0A            break;\0D\0A        case 2:\0D\0A            float refractionIndex = meshBuffer.Albedo.x;\0D\0A            payload = ScatterDielectric(meshBuffer.Albedo, worlRayDirection, triangleNormal, t, payload.seed, refractionIndex);\0D\0A            break;\0D\0A    }\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid MyMissShader(inout RayPayload payload)\0D\0A{\0D\0A    float a = 0.5 * (normalize(WorldRayDirection().y + 1.0));\0D\0A    payload.colorAndDistance.rgb = (1.0 - a) * float3(1.0, 1.0, 1.0) + a * float3(0.5, 0.7, 1.0);\0D\0A    payload.colorAndDistance.w = -1;\0D\0A}\0D\0A\0D\0A#endif // RAYTRACING_HLSL"}
!171 = !{!".\5CHlslCompat.h", !"//*********************************************************\0D\0A//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A//*********************************************************\0D\0A\0D\0A#ifndef HLSLCOMPAT_H\0D\0A#define HLSLCOMPAT_H\0D\0A\0D\0Atypedef float3 XMFLOAT3;\0D\0Atypedef float4 XMFLOAT4;\0D\0Atypedef float4 XMVECTOR;\0D\0Atypedef float4x4 XMMATRIX;\0D\0Atypedef uint UINT;\0D\0A\0D\0A#endif // HLSLCOMPAT_H"}
!172 = !{!".\5CRandom.hlsl", !"// CODE FROM: \0D\0A// https://github.com/GPSnoopy/RayTracingInVulkan\0D\0A// Generates a seed for a random number generator from 2 inputs plus a backoff\0D\0A// https://github.com/nvpro-samples/optix_prime_baking/blob/332a886f1ac46c0b3eea9e89a59593470c755a0e/random.h\0D\0A// https://github.com/nvpro-samples/vk_raytracing_tutorial_KHR/tree/master/ray_tracing_jitter_cam\0D\0A// https://en.wikipedia.org/wiki/Tiny_Encryption_Algorithm\0D\0Auint InitRandomSeed(uint val0, uint val1)\0D\0A{\0D\0A    uint v0 = val0, v1 = val1, s0 = 0;\0D\0A    \0D\0A    [unroll]\0D\0A    for (uint n = 0; n < 16; n++)\0D\0A    {\0D\0A        s0 += 0x9e3779b9;\0D\0A        v0 += ((v1 << 4) + 0xa341316c) ^ (v1 + s0) ^ ((v1 >> 5) + 0xc8013ea4);\0D\0A        v1 += ((v0 << 4) + 0xad90777d) ^ (v0 + s0) ^ ((v0 >> 5) + 0x7e95761e);\0D\0A    }\0D\0A\0D\0A    return v0;\0D\0A}\0D\0A\0D\0Auint RandomInt(inout uint seed)\0D\0A{\0D\0A\09// LCG values from Numerical Recipes\0D\0A    return (seed = 1664525 * seed + 1013904223);\0D\0A}\0D\0A\0D\0Afloat RandomFloat(inout uint seed)\0D\0A{\0D\0A\09//// Float version using bitmask from Numerical Recipes\0D\0A\09//const uint one = 0x3f800000;\0D\0A\09//const uint msk = 0x007fffff;\0D\0A\09//return uintBitsToFloat(one | (msk & (RandomInt(seed) >> 9))) - 1;\0D\0A\0D\0A\09// Faster version from NVIDIA examples; quality good enough for our use case.\0D\0A    return (float(RandomInt(seed) & 0x00FFFFFF) / float(0x01000000));\0D\0A}\0D\0A\0D\0Afloat3 SampleSquare(uint seed)\0D\0A{\0D\0A    // Returns the vector to a random point in the [-.5,-.5]-[+.5,+.5] unit square.\0D\0A    return float3(RandomFloat(seed) - 0.5, RandomFloat(seed) - 0.5, 0);\0D\0A}\0D\0A\0D\0Afloat2 RandomInUnitDisk(inout uint seed)\0D\0A{\0D\0A    for (;;)\0D\0A    {\0D\0A        const float2 p = 2 * float2(RandomFloat(seed), RandomFloat(seed)) - 1;\0D\0A        if (dot(p, p) < 1)\0D\0A        {\0D\0A            return p;\0D\0A        }\0D\0A    }\0D\0A}\0D\0A\0D\0Afloat3 RandomInUnitSphere(inout uint seed)\0D\0A{\0D\0A    for (;;)\0D\0A    {\0D\0A        const float3 p = normalize(2 * float3(RandomFloat(seed), RandomFloat(seed), RandomFloat(seed)) - 1);\0D\0A        if (dot(p, p) < 1)\0D\0A        {\0D\0A            return p;\0D\0A        }\0D\0A    }\0D\0A}"}
!173 = !{!".\5CRaytracingHlslCompat.h", !"//*********************************************************\0D\0A//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A//*********************************************************\0D\0A\0D\0A#ifndef RAYTRACINGHLSLCOMPAT_H\0D\0A#define RAYTRACINGHLSLCOMPAT_H\0D\0A\0D\0A#ifdef HLSL\0D\0A#include \22HlslCompat.h\22\0D\0A#else\0D\0Ausing namespace DirectX;\0D\0A\0D\0A// Shader will use byte encoding to access indices.\0D\0Atypedef UINT16 Index;\0D\0A#endif\0D\0A\0D\0Astruct FrameBuffer\0D\0A{\0D\0A\09XMMATRIX ProjectionToWorld;\0D\0A\09XMMATRIX ModelViewInverse;\0D\0A\09XMVECTOR CameraPosition;\0D\0A};\0D\0A\0D\0Astruct MeshBuffer\0D\0A{\0D\0A\09XMFLOAT4 Albedo;\0D\0A\09int MeshID;\0D\0A\09int MaterialID;\0D\0A\09int VerticesOffset;\0D\0A\09int IndicesOffset;\0D\0A};\0D\0A\0D\0Astruct Vertex\0D\0A{\0D\0A\09XMFLOAT3 Position;\0D\0A\09float pad1;\0D\0A\09XMFLOAT3 Normal;\0D\0A\09float pad2;\0D\0A};\0D\0A\0D\0A#endif // RAYTRACINGHLSLCOMPAT_H"}
!174 = !{!"Raytracing.hlsl"}
!175 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_3", !"/Fo", !"E:\5COWL_Git\5CRaytracingOneWeekPractice\5Cray3DXR\5Cx64\5CDebug\5CRaytracing.cso", !"/Od", !"/Zi", !"/Zpr", !"-Qembed_debug"}
!176 = !{i32 1, i32 3}
!177 = !{i32 1, i32 7}
!178 = !{!"lib", i32 6, i32 3}
!179 = !{!180, !187, !190, null}
!180 = !{!181, !183, !185}
!181 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?Scene@@3URaytracingAccelerationStructure@@A", !"Scene", i32 0, i32 0, i32 1, i32 16, i32 0, !182}
!182 = !{i32 0, i32 4}
!183 = !{i32 1, %"class.StructuredBuffer<int>"* @"\01?Indices@@3V?$StructuredBuffer@H@@A", !"Indices", i32 0, i32 1, i32 1, i32 12, i32 0, !184}
!184 = !{i32 1, i32 4}
!185 = !{i32 2, %"class.StructuredBuffer<Vertex>"* @"\01?Vertices@@3V?$StructuredBuffer@UVertex@@@@A", !"Vertices", i32 0, i32 2, i32 1, i32 12, i32 0, !186}
!186 = !{i32 1, i32 32}
!187 = !{!188}
!188 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* @"\01?RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", !"RenderTarget", i32 0, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !189}
!189 = !{i32 0, i32 9}
!190 = !{!191, !192}
!191 = !{i32 0, %hostlayout.frameBuffer* @frameBuffer_legacy, !"frameBuffer", i32 0, i32 0, i32 1, i32 144, null}
!192 = !{i32 1, %meshBuffer* @meshBuffer, !"meshBuffer", i32 0, i32 1, i32 1, i32 32, null}
!193 = !{i32 0, %"class.StructuredBuffer<int>" undef, !194, %"class.StructuredBuffer<Vertex>" undef, !196, %struct.Vertex undef, !198, %struct.MeshBuffer undef, !203, %struct.BuiltInTriangleIntersectionAttributes undef, !209, %struct.RayPayload undef, !211, %meshBuffer undef, !215, %hostlayout.struct.FrameBuffer undef, !217, %hostlayout.frameBuffer undef, !222}
!194 = !{i32 4, !195}
!195 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 4}
!196 = !{i32 32, !197}
!197 = !{i32 6, !"h", i32 3, i32 0}
!198 = !{i32 32, !199, !200, !201, !202}
!199 = !{i32 6, !"Position", i32 3, i32 0, i32 7, i32 9}
!200 = !{i32 6, !"pad1", i32 3, i32 12, i32 7, i32 9}
!201 = !{i32 6, !"Normal", i32 3, i32 16, i32 7, i32 9}
!202 = !{i32 6, !"pad2", i32 3, i32 28, i32 7, i32 9}
!203 = !{i32 32, !204, !205, !206, !207, !208}
!204 = !{i32 6, !"Albedo", i32 3, i32 0, i32 7, i32 9}
!205 = !{i32 6, !"MeshID", i32 3, i32 16, i32 7, i32 4}
!206 = !{i32 6, !"MaterialID", i32 3, i32 20, i32 7, i32 4}
!207 = !{i32 6, !"VerticesOffset", i32 3, i32 24, i32 7, i32 4}
!208 = !{i32 6, !"IndicesOffset", i32 3, i32 28, i32 7, i32 4}
!209 = !{i32 8, !210}
!210 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!211 = !{i32 36, !212, !213, !214}
!212 = !{i32 6, !"colorAndDistance", i32 3, i32 0, i32 7, i32 9}
!213 = !{i32 6, !"scatterDirection", i32 3, i32 16, i32 7, i32 9}
!214 = !{i32 6, !"seed", i32 3, i32 32, i32 7, i32 5}
!215 = !{i32 32, !216}
!216 = !{i32 6, !"meshBuffer", i32 3, i32 0}
!217 = !{i32 144, !218, !220, !221}
!218 = !{i32 6, !"ProjectionToWorld", i32 2, !219, i32 3, i32 0, i32 7, i32 9}
!219 = !{i32 4, i32 4, i32 1}
!220 = !{i32 6, !"ModelViewInverse", i32 2, !219, i32 3, i32 64, i32 7, i32 9}
!221 = !{i32 6, !"CameraPosition", i32 3, i32 128, i32 7, i32 9}
!222 = !{i32 144, !223}
!223 = !{i32 6, !"frameBuffer", i32 3, i32 0}
!224 = !{i32 1, void ()* @"\01?MyRaygenShader@@YAXXZ", !225, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !227, void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z", !230}
!225 = !{!226}
!226 = !{i32 1, !2, !2}
!227 = !{!226, !228, !229}
!228 = !{i32 2, !2, !2}
!229 = !{i32 0, !2, !2}
!230 = !{!226, !228}
!231 = !{null, !"", null, !179, !232}
!232 = !{i32 0, i64 73745}
!233 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !234}
!234 = !{i32 8, i32 10, i32 6, i32 36, i32 7, i32 8, i32 5, !235}
!235 = !{i32 0}
!236 = !{void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z", !"\01?MyMissShader@@YAXURayPayload@@@Z", null, null, !237}
!237 = !{i32 8, i32 11, i32 6, i32 36, i32 5, !235}
!238 = !{void ()* @"\01?MyRaygenShader@@YAXXZ", !"\01?MyRaygenShader@@YAXXZ", null, null, !239}
!239 = !{i32 8, i32 7, i32 5, !235}
!240 = !DILocation(line: 148, column: 13, scope: !241)
!241 = distinct !DILexicalBlock(scope: !242, file: !1, line: 132, column: 9)
!242 = distinct !DILexicalBlock(scope: !243, file: !1, line: 131, column: 9)
!243 = distinct !DILexicalBlock(scope: !244, file: !1, line: 131, column: 9)
!244 = distinct !DILexicalBlock(scope: !245, file: !1, line: 119, column: 5)
!245 = distinct !DILexicalBlock(scope: !246, file: !1, line: 118, column: 5)
!246 = distinct !DILexicalBlock(scope: !83, file: !1, line: 118, column: 5)
!247 = !DILocation(line: 172, column: 5, scope: !83)
!248 = !DILocation(line: 109, column: 10, scope: !83)
!249 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "TotalNumberOfSamples", scope: !83, file: !1, line: 109, type: !36)
!250 = !DIExpression()
!251 = !DILocation(line: 110, column: 76, scope: !83)
!252 = !DILocation(line: 110, column: 53, scope: !83)
!253 = !DILocation(line: 110, column: 38, scope: !83)
!254 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "val1", arg: 2, scope: !32, file: !33, line: 7, type: !36)
!255 = !DILocation(line: 7, column: 37, scope: !32, inlinedAt: !256)
!256 = distinct !DILocation(line: 110, column: 38, scope: !83)
!257 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "val0", arg: 1, scope: !32, file: !33, line: 7, type: !36)
!258 = !DILocation(line: 7, column: 26, scope: !32, inlinedAt: !256)
!259 = !DILocation(line: 9, column: 10, scope: !32, inlinedAt: !256)
!260 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v0", scope: !32, file: !33, line: 9, type: !36)
!261 = !DILocation(line: 9, column: 21, scope: !32, inlinedAt: !256)
!262 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v1", scope: !32, file: !33, line: 9, type: !36)
!263 = !DILocation(line: 9, column: 32, scope: !32, inlinedAt: !256)
!264 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s0", scope: !32, file: !33, line: 9, type: !36)
!265 = !DILocation(line: 12, column: 15, scope: !266, inlinedAt: !256)
!266 = distinct !DILexicalBlock(scope: !32, file: !33, line: 12, column: 5)
!267 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !266, file: !33, line: 12, type: !36)
!268 = !DILocation(line: 12, column: 5, scope: !266, inlinedAt: !256)
!269 = !DILocation(line: 14, column: 12, scope: !270, inlinedAt: !256)
!270 = distinct !DILexicalBlock(scope: !271, file: !33, line: 13, column: 5)
!271 = distinct !DILexicalBlock(scope: !266, file: !33, line: 12, column: 5)
!272 = !DILocation(line: 15, column: 20, scope: !270, inlinedAt: !256)
!273 = !DILocation(line: 15, column: 26, scope: !270, inlinedAt: !256)
!274 = !DILocation(line: 15, column: 46, scope: !270, inlinedAt: !256)
!275 = !DILocation(line: 15, column: 40, scope: !270, inlinedAt: !256)
!276 = !DILocation(line: 15, column: 59, scope: !270, inlinedAt: !256)
!277 = !DILocation(line: 15, column: 65, scope: !270, inlinedAt: !256)
!278 = !DILocation(line: 15, column: 52, scope: !270, inlinedAt: !256)
!279 = !DILocation(line: 15, column: 12, scope: !270, inlinedAt: !256)
!280 = !DILocation(line: 16, column: 20, scope: !270, inlinedAt: !256)
!281 = !DILocation(line: 16, column: 26, scope: !270, inlinedAt: !256)
!282 = !DILocation(line: 16, column: 46, scope: !270, inlinedAt: !256)
!283 = !DILocation(line: 16, column: 40, scope: !270, inlinedAt: !256)
!284 = !DILocation(line: 16, column: 59, scope: !270, inlinedAt: !256)
!285 = !DILocation(line: 16, column: 65, scope: !270, inlinedAt: !256)
!286 = !DILocation(line: 16, column: 52, scope: !270, inlinedAt: !256)
!287 = !DILocation(line: 16, column: 12, scope: !270, inlinedAt: !256)
!288 = !DILocation(line: 12, column: 31, scope: !271, inlinedAt: !256)
!289 = distinct !{!289, !290}
!290 = !{!"llvm.loop.unroll.full"}
!291 = !DILocation(line: 19, column: 5, scope: !32, inlinedAt: !256)
!292 = !DILocation(line: 110, column: 23, scope: !83)
!293 = !DILocation(line: 7, column: 37, scope: !32, inlinedAt: !294)
!294 = distinct !DILocation(line: 110, column: 23, scope: !83)
!295 = !DILocation(line: 7, column: 26, scope: !32, inlinedAt: !294)
!296 = !DILocation(line: 9, column: 10, scope: !32, inlinedAt: !294)
!297 = !DILocation(line: 9, column: 21, scope: !32, inlinedAt: !294)
!298 = !DILocation(line: 9, column: 32, scope: !32, inlinedAt: !294)
!299 = !DILocation(line: 12, column: 15, scope: !266, inlinedAt: !294)
!300 = !DILocation(line: 12, column: 5, scope: !266, inlinedAt: !294)
!301 = !DILocation(line: 14, column: 12, scope: !270, inlinedAt: !294)
!302 = !DILocation(line: 15, column: 12, scope: !270, inlinedAt: !294)
!303 = !DILocation(line: 16, column: 20, scope: !270, inlinedAt: !294)
!304 = !DILocation(line: 16, column: 26, scope: !270, inlinedAt: !294)
!305 = !DILocation(line: 16, column: 46, scope: !270, inlinedAt: !294)
!306 = !DILocation(line: 16, column: 40, scope: !270, inlinedAt: !294)
!307 = !DILocation(line: 16, column: 59, scope: !270, inlinedAt: !294)
!308 = !DILocation(line: 16, column: 65, scope: !270, inlinedAt: !294)
!309 = !DILocation(line: 16, column: 52, scope: !270, inlinedAt: !294)
!310 = !DILocation(line: 16, column: 12, scope: !270, inlinedAt: !294)
!311 = !DILocation(line: 12, column: 31, scope: !271, inlinedAt: !294)
!312 = !DILocation(line: 15, column: 20, scope: !270, inlinedAt: !294)
!313 = !DILocation(line: 15, column: 26, scope: !270, inlinedAt: !294)
!314 = !DILocation(line: 15, column: 46, scope: !270, inlinedAt: !294)
!315 = !DILocation(line: 15, column: 40, scope: !270, inlinedAt: !294)
!316 = !DILocation(line: 15, column: 59, scope: !270, inlinedAt: !294)
!317 = !DILocation(line: 15, column: 65, scope: !270, inlinedAt: !294)
!318 = !DILocation(line: 15, column: 52, scope: !270, inlinedAt: !294)
!319 = !DILocation(line: 19, column: 5, scope: !32, inlinedAt: !294)
!320 = !DILocation(line: 110, column: 10, scope: !83)
!321 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "seed", arg: 1, scope: !38, file: !33, line: 22, type: !36)
!322 = !DILocation(line: 22, column: 27, scope: !38, inlinedAt: !323)
!323 = distinct !DILocation(line: 36, column: 19, scope: !43, inlinedAt: !324)
!324 = distinct !DILocation(line: 49, column: 37, scope: !325, inlinedAt: !328)
!325 = distinct !DILexicalBlock(scope: !326, file: !33, line: 48, column: 5)
!326 = distinct !DILexicalBlock(scope: !327, file: !33, line: 47, column: 5)
!327 = distinct !DILexicalBlock(scope: !49, file: !33, line: 47, column: 5)
!328 = distinct !DILocation(line: 126, column: 40, scope: !244)
!329 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "seed", arg: 1, scope: !43, file: !33, line: 28, type: !36)
!330 = !DILocation(line: 28, column: 30, scope: !43, inlinedAt: !324)
!331 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "seed", arg: 1, scope: !49, file: !33, line: 45, type: !36)
!332 = !DILocation(line: 45, column: 36, scope: !49, inlinedAt: !328)
!333 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "randomSeed", scope: !83, file: !1, line: 110, type: !36)
!334 = !DILocation(line: 111, column: 10, scope: !83)
!335 = !DILocation(line: 22, column: 27, scope: !38, inlinedAt: !336)
!336 = distinct !DILocation(line: 36, column: 19, scope: !43, inlinedAt: !337)
!337 = distinct !DILocation(line: 122, column: 61, scope: !244)
!338 = !DILocation(line: 28, column: 30, scope: !43, inlinedAt: !337)
!339 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pixelRandomSeed", scope: !83, file: !1, line: 111, type: !36)
!340 = !DILocation(line: 113, column: 10, scope: !83)
!341 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bounces", scope: !83, file: !1, line: 113, type: !36)
!342 = !DILocation(line: 114, column: 11, scope: !83)
!343 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aperture", scope: !83, file: !1, line: 114, type: !4)
!344 = !DILocation(line: 115, column: 11, scope: !83)
!345 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "focusDistance", scope: !83, file: !1, line: 115, type: !4)
!346 = !DILocation(line: 116, column: 12, scope: !83)
!347 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "color", scope: !83, file: !1, line: 116, type: !5)
!348 = !DILocation(line: 118, column: 14, scope: !246)
!349 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sample", scope: !246, file: !1, line: 118, type: !14)
!350 = !DILocation(line: 118, column: 5, scope: !246)
!351 = !DILocation(line: 28, column: 30, scope: !43, inlinedAt: !352)
!352 = distinct !DILocation(line: 122, column: 115, scope: !244)
!353 = !DILocation(line: 22, column: 27, scope: !38, inlinedAt: !354)
!354 = distinct !DILocation(line: 36, column: 19, scope: !43, inlinedAt: !352)
!355 = !DIExpression(DW_OP_bit_piece, 0, 32)
!356 = !DIExpression(DW_OP_bit_piece, 32, 32)
!357 = !DIExpression(DW_OP_bit_piece, 64, 32)
!358 = !DILocation(line: 120, column: 16, scope: !244)
!359 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rayColor", scope: !244, file: !1, line: 120, type: !5)
!360 = !DILocation(line: 122, column: 37, scope: !244)
!361 = !DILocation(line: 122, column: 61, scope: !244)
!362 = !DILocation(line: 36, column: 19, scope: !43, inlinedAt: !337)
!363 = !DILocation(line: 25, column: 28, scope: !38, inlinedAt: !336)
!364 = !DILocation(line: 25, column: 35, scope: !38, inlinedAt: !336)
!365 = !DILocation(line: 25, column: 18, scope: !38, inlinedAt: !336)
!366 = !DILocation(line: 25, column: 5, scope: !38, inlinedAt: !336)
!367 = !DILocation(line: 36, column: 35, scope: !43, inlinedAt: !337)
!368 = !DILocation(line: 36, column: 49, scope: !43, inlinedAt: !337)
!369 = !DILocation(line: 36, column: 5, scope: !43, inlinedAt: !337)
!370 = !DILocation(line: 122, column: 59, scope: !244)
!371 = !DILocation(line: 122, column: 91, scope: !244)
!372 = !DILocation(line: 122, column: 115, scope: !244)
!373 = !DILocation(line: 36, column: 19, scope: !43, inlinedAt: !352)
!374 = !DILocation(line: 25, column: 28, scope: !38, inlinedAt: !354)
!375 = !DILocation(line: 25, column: 35, scope: !38, inlinedAt: !354)
!376 = !DILocation(line: 25, column: 18, scope: !38, inlinedAt: !354)
!377 = !DILocation(line: 25, column: 5, scope: !38, inlinedAt: !354)
!378 = !DILocation(line: 36, column: 35, scope: !43, inlinedAt: !352)
!379 = !DILocation(line: 36, column: 49, scope: !43, inlinedAt: !352)
!380 = !DILocation(line: 36, column: 5, scope: !43, inlinedAt: !352)
!381 = !DILocation(line: 122, column: 113, scope: !244)
!382 = !DILocation(line: 122, column: 22, scope: !244)
!383 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pixel", scope: !244, file: !1, line: 122, type: !384)
!384 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!385 = !DILocation(line: 123, column: 30, scope: !244)
!386 = !DILocation(line: 123, column: 28, scope: !244)
!387 = !DILocation(line: 123, column: 59, scope: !244)
!388 = !DILocation(line: 123, column: 65, scope: !244)
!389 = !DILocation(line: 123, column: 16, scope: !244)
!390 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uv", scope: !244, file: !1, line: 123, type: !15)
!391 = !DILocation(line: 124, column: 14, scope: !244)
!392 = !DILocation(line: 126, column: 40, scope: !244)
!393 = !DILocation(line: 47, column: 5, scope: !49, inlinedAt: !328)
!394 = !DILocation(line: 28, column: 30, scope: !43, inlinedAt: !395)
!395 = distinct !DILocation(line: 49, column: 56, scope: !325, inlinedAt: !328)
!396 = !DILocation(line: 22, column: 27, scope: !38, inlinedAt: !397)
!397 = distinct !DILocation(line: 36, column: 19, scope: !43, inlinedAt: !395)
!398 = !DILocation(line: 49, column: 37, scope: !325, inlinedAt: !328)
!399 = !DILocation(line: 36, column: 19, scope: !43, inlinedAt: !324)
!400 = !DILocation(line: 25, column: 28, scope: !38, inlinedAt: !323)
!401 = !DILocation(line: 25, column: 35, scope: !38, inlinedAt: !323)
!402 = !DILocation(line: 25, column: 18, scope: !38, inlinedAt: !323)
!403 = !DILocation(line: 25, column: 5, scope: !38, inlinedAt: !323)
!404 = !DILocation(line: 36, column: 35, scope: !43, inlinedAt: !324)
!405 = !DILocation(line: 36, column: 49, scope: !43, inlinedAt: !324)
!406 = !DILocation(line: 36, column: 5, scope: !43, inlinedAt: !324)
!407 = !DILocation(line: 49, column: 56, scope: !325, inlinedAt: !328)
!408 = !DILocation(line: 36, column: 19, scope: !43, inlinedAt: !395)
!409 = !DILocation(line: 25, column: 28, scope: !38, inlinedAt: !397)
!410 = !DILocation(line: 25, column: 35, scope: !38, inlinedAt: !397)
!411 = !DILocation(line: 25, column: 18, scope: !38, inlinedAt: !397)
!412 = !DILocation(line: 25, column: 5, scope: !38, inlinedAt: !397)
!413 = !DILocation(line: 36, column: 35, scope: !43, inlinedAt: !395)
!414 = !DILocation(line: 36, column: 49, scope: !43, inlinedAt: !395)
!415 = !DILocation(line: 36, column: 5, scope: !43, inlinedAt: !395)
!416 = !DILocation(line: 49, column: 28, scope: !325, inlinedAt: !328)
!417 = !DILocation(line: 49, column: 75, scope: !325, inlinedAt: !328)
!418 = !DILocation(line: 49, column: 22, scope: !325, inlinedAt: !328)
!419 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !325, file: !33, line: 49, type: !384)
!420 = !DILocation(line: 50, column: 13, scope: !421, inlinedAt: !328)
!421 = distinct !DILexicalBlock(scope: !325, file: !33, line: 50, column: 13)
!422 = !DILocation(line: 50, column: 23, scope: !421, inlinedAt: !328)
!423 = !DILocation(line: 50, column: 13, scope: !325, inlinedAt: !328)
!424 = !DILocation(line: 52, column: 13, scope: !425, inlinedAt: !328)
!425 = distinct !DILexicalBlock(scope: !421, file: !33, line: 51, column: 9)
!426 = !DILocation(line: 126, column: 38, scope: !244)
!427 = !DILocation(line: 126, column: 16, scope: !244)
!428 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset", scope: !244, file: !1, line: 126, type: !15)
!429 = !DILocation(line: 127, column: 63, scope: !244)
!430 = !DILocation(line: 127, column: 25, scope: !244)
!431 = !DILocation(line: 127, column: 16, scope: !244)
!432 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "origin", scope: !244, file: !1, line: 127, type: !22)
!433 = !DILocation(line: 128, column: 69, scope: !244)
!434 = !DILocation(line: 128, column: 25, scope: !244)
!435 = !DILocation(line: 128, column: 16, scope: !244)
!436 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "target", scope: !244, file: !1, line: 128, type: !22)
!437 = !DILocation(line: 129, column: 114, scope: !244)
!438 = !DILocation(line: 129, column: 60, scope: !244)
!439 = !DILocation(line: 129, column: 76, scope: !244)
!440 = !DILocation(line: 129, column: 39, scope: !244)
!441 = !DILocation(line: 129, column: 28, scope: !244)
!442 = !DILocation(line: 129, column: 16, scope: !244)
!443 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "direction", scope: !244, file: !1, line: 129, type: !22)
!444 = !DILocation(line: 131, column: 18, scope: !243)
!445 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !243, file: !1, line: 131, type: !14)
!446 = !DILocation(line: 131, column: 9, scope: !243)
!447 = !DILocation(line: 133, column: 19, scope: !448)
!448 = distinct !DILexicalBlock(scope: !241, file: !1, line: 133, column: 17)
!449 = !DILocation(line: 133, column: 17, scope: !241)
!450 = !DILocation(line: 135, column: 26, scope: !451)
!451 = distinct !DILexicalBlock(scope: !448, file: !1, line: 134, column: 13)
!452 = !DILocation(line: 136, column: 17, scope: !451)
!453 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ray", scope: !241, file: !1, line: 139, type: !454)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 139, size: 256, align: 32, elements: !455)
!455 = !{!456, !457, !458, !459}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !454, file: !1, line: 139, baseType: !6, size: 96, align: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !454, file: !1, line: 139, baseType: !4, size: 32, align: 32, offset: 96)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !454, file: !1, line: 139, baseType: !6, size: 96, align: 32, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !454, file: !1, line: 139, baseType: !4, size: 32, align: 32, offset: 224)
!460 = !DILocation(line: 139, column: 21, scope: !241)
!461 = !DILocation(line: 140, column: 26, scope: !241)
!462 = !DILocation(line: 140, column: 17, scope: !241)
!463 = !DILocation(line: 140, column: 24, scope: !241)
!464 = !DILocation(line: 141, column: 29, scope: !241)
!465 = !DILocation(line: 141, column: 17, scope: !241)
!466 = !DILocation(line: 141, column: 27, scope: !241)
!467 = !DILocation(line: 142, column: 17, scope: !241)
!468 = !DILocation(line: 142, column: 22, scope: !241)
!469 = !DILocation(line: 143, column: 17, scope: !241)
!470 = !DILocation(line: 143, column: 22, scope: !241)
!471 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "payload", scope: !241, file: !1, line: 145, type: !74)
!472 = !DILocation(line: 145, column: 24, scope: !241)
!473 = !DILocation(line: 145, column: 47, scope: !241)
!474 = !DILocation(line: 146, column: 21, scope: !241)
!475 = !DILocation(line: 146, column: 26, scope: !241)
!476 = !DILocation(line: 150, column: 45, scope: !241)
!477 = !DILocation(line: 150, column: 37, scope: !241)
!478 = !DILocation(line: 150, column: 26, scope: !241)
!479 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hitColor", scope: !241, file: !1, line: 150, type: !480)
!480 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!481 = !DILocation(line: 151, column: 37, scope: !241)
!482 = !DILocation(line: 151, column: 29, scope: !241)
!483 = !DILocation(line: 151, column: 25, scope: !241)
!484 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !241, file: !1, line: 151, type: !58)
!485 = !DILocation(line: 152, column: 46, scope: !241)
!486 = !DILocation(line: 152, column: 38, scope: !241)
!487 = !DILocation(line: 152, column: 65, scope: !241)
!488 = !DILocation(line: 152, column: 24, scope: !241)
!489 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "isScattered", scope: !241, file: !1, line: 152, type: !490)
!490 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !491)
!491 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!492 = !DILocation(line: 154, column: 22, scope: !241)
!493 = !DILocation(line: 156, column: 19, scope: !494)
!494 = distinct !DILexicalBlock(scope: !241, file: !1, line: 156, column: 17)
!495 = !DILocation(line: 156, column: 23, scope: !494)
!496 = !DILocation(line: 156, column: 27, scope: !494)
!497 = !DILocation(line: 156, column: 17, scope: !241)
!498 = !DILocation(line: 158, column: 17, scope: !499)
!499 = distinct !DILexicalBlock(scope: !494, file: !1, line: 157, column: 13)
!500 = !DILocation(line: 161, column: 31, scope: !241)
!501 = !DILocation(line: 161, column: 33, scope: !241)
!502 = !DILocation(line: 161, column: 29, scope: !241)
!503 = !DILocation(line: 161, column: 20, scope: !241)
!504 = !DILocation(line: 162, column: 40, scope: !241)
!505 = !DILocation(line: 162, column: 32, scope: !241)
!506 = !DILocation(line: 162, column: 23, scope: !241)
!507 = !DIExpression(DW_OP_bit_piece, 96, 32)
!508 = !DILocation(line: 164, column: 9, scope: !241)
!509 = !DILocation(line: 131, column: 39, scope: !242)
!510 = !DILocation(line: 131, column: 27, scope: !242)
!511 = !DILocation(line: 165, column: 15, scope: !244)
!512 = !DILocation(line: 166, column: 5, scope: !244)
!513 = !DILocation(line: 118, column: 63, scope: !245)
!514 = !DILocation(line: 118, column: 33, scope: !245)
!515 = !DILocation(line: 168, column: 11, scope: !83)
!516 = !DILocation(line: 169, column: 13, scope: !83)
!517 = !DILocation(line: 169, column: 11, scope: !83)
!518 = !DILocation(line: 172, column: 18, scope: !83)
!519 = !DILocation(line: 172, column: 46, scope: !83)
!520 = !DILocation(line: 173, column: 18, scope: !83)
!521 = !DILocation(line: 173, column: 5, scope: !83)
!522 = !DILocation(line: 173, column: 44, scope: !83)
!523 = !DILocation(line: 174, column: 1, scope: !83)
!524 = !DILocation(line: 193, column: 9, scope: !86)
